{
  "id": "4ecad106-2a37-4953-a742-03fdd6fb7d98",
  "title": "CISA and Partners Release Guidance for Ongoing Global Exploitation of Cisco SD-WAN Systems",
  "url": "https://www.cisa.gov/news-events/alerts/2026/02/25/cisa-and-partners-release-guidance-ongoing-global-exploitation-cisco-sd-wan-systems",
  "content": "<p><em>The purpose of this Alert is to provide resources for organizations with Cisco Software-Defined Wide-Area Networking (SD-WAN) systems, including Federal Civilian Executive Branch (FCEB) agencies, to address ongoing exploitation of multiple vulnerabilities. Notably, the Cybersecurity and Infrastructure Security Agency (CISA) has added&nbsp;</em><a href=\"https://www.cve.org/CVERecord?id=CVE-2026-20127\"><em>CVE-2026-20127</em></a><em> and&nbsp;</em><a href=\"https://www.cve.org/CVERecord?id=CVE-2022-20775\"><em>CVE-2022-20775</em></a><em> to its Known Exploited Vulnerabilities (KEV) Catalog on Feb. 25, 2026. As a result of the malicious cyber activity and vulnerabilities involving Cisco SD-WAN systems, CISA has outlined requirements for FCEB agencies in Emergency Directive (ED) 26-03 to inventory Cisco SD-WAN systems, update them, and assess compromise.</em></p>\n<p>CISA and partners have observed malicious cyber actors targeting and compromising Cisco SD-WAN systems of organizations, globally. These actors have been observed exploiting a previously undisclosed authentication bypass vulnerability, CVE-2026-20127, for initial access before escalating privileges using CVE-2022-20775 and establishing long-term persistence in Cisco SD-WAN systems.</p>\n<p>CISA, National Security Agency (NSA), and international partners Australian Signals Directorate’s Australian Cyber Security Centre (ASD’s ACSC), Canadian Centre for Cyber Security (Cyber Centre), New Zealand National Cyber Security Centre (NCSC-NZ), and United Kingdom National Cyber Security Centre (NCSC-UK), hereafter the “authoring organizations,” strongly urge network defenders to immediately 1) inventory all in-scope Cisco SD-WAN systems, 2) collect artifacts, including virtual snapshots and logs off of SD-WAN systems to support threat hunt activities, 3) fully patch Cisco SD-WAN systems with available updates, 4) hunt for evidence of compromise, and 5) concurrently review Cisco’s latest security advisories, <a href=\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-sdwan-rpa-EHchtZk\">Cisco Catalyst SD-WAN Controller Authentication Bypass Vulnerability</a> and <a href=\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-sdwan-authbp-qwCX8D4v\">Cisco Catalyst SD-WAN Vulnerabilities</a>, and implement <a href=\"https://sec.cloudapps.cisco.com/security/center/resources/Cisco-Catalyst-SD-WAN-HardeningGuide\">Cisco’s SD-WAN Hardening Guidance</a>.<a href=\"#note1\"><sup>1</sup></a></p>\n<p>To address malicious activity involving vulnerable Cisco SD-WAN systems, CISA issued <a href=\"https://www.cisa.gov/news-events/directives/ed-26-03-mitigate-vulnerabilities-cisco-sd-wan-systems\">Emergency Directive 26-03: Mitigate Vulnerabilities in Cisco SD-WAN Systems</a>, which outlines requirements for FCEB agencies to inventory Cisco SD-WAN systems, update them, and assess compromise. Further, CISA released <a href=\"https://www.cisa.gov/news-events/directives/supplemental-direction-ed-26-03-hunt-and-hardening-guidance-cisco-sd-wan-systems\">Supplemental Direction ED 26-03: Hunt and Hardening Guidance for Cisco SD-WAN Systems</a> to provide prescriptive actions for FCEB agencies.&nbsp;</p>\n<p>Cisco’s Catalyst SD-WAN Hardening Guide recommends that network defenders address:</p>\n<ul>\n<li><strong>Network perimeter controls</strong>: Ensure control components are behind a firewall, isolate virtual private network (VPN) 512 interfaces, and use internet protocol (IP) blocks for manually provisioned edge IPs.</li>\n<li><strong>SD-WAN manager access</strong>: Replace the self-signed certificate for the web user interface.</li>\n<li><strong>Control and data plane security</strong>: Use pairwise keys.</li>\n<li><strong>Session timeout</strong>: Limit to the shortest period possible.</li>\n<li><strong>Logging</strong>: Forward to a remote syslog server.</li>\n</ul>\n<p>CISA and the authoring organizations are providing the following resources: &nbsp;</p>\n<ul>\n<li>CISA: <a href=\"https://www.cisa.gov/news-events/directives/ed-26-03-mitigate-vulnerabilities-cisco-sd-wan-systems\">Emergency Directive 26-03: Mitigate Vulnerabilities in Cisco SD-WAN Systems</a></li>\n<li>CISA: <a href=\"https://www.cisa.gov/news-events/directives/supplemental-direction-ed-26-03-hunt-and-hardening-guidance-cisco-sd-wan-systems\">Supplemental Direction ED 26-03: Hunt and Hardening Guidance for Cisco SD-WAN Systems</a></li>\n<li>Cisco: <a href=\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-sdwan-rpa-EHchtZk\">Cisco Catalyst SD-WAN Controller Authentication Bypass Vulnerability</a></li>\n<li>Cisco: <a href=\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-sdwan-authbp-qwCX8D4v\">Cisco Catalyst SD-WAN Vulnerabilities</a></li>\n<li>Cisco: <a href=\"https://sec.cloudapps.cisco.com/security/center/resources/Cisco-Catalyst-SD-WAN-HardeningGuide\">Cisco Catalyst SD-WAN Hardening Guide</a></li>\n<li>ASD’s ACSC: <a href=\"https://www.cyber.gov.au/sites/default/files/2026-02/ACSC-led%20Cisco%20SD-WAN%20Hunt%20Guide.pdf\">Cisco SD-WAN Threat Hunt Guide</a>, co-sealed by CISA, NSA, Cyber Centre, NCSC-NZ, and NCSC-UK. This guide, based on investigative data, supports network defenders’ detection of and response to the malicious actors’ threat activity</li>\n</ul>\n<h2><strong>Acknowledgements</strong></h2>\n<p>NSA, ASD’s ACSC, Cyber Centre, NCSC-NZ, and NCSC-UK contributed to this alert<strong>.</strong></p>\n<h2><strong>Disclaimer</strong></h2>\n<p>The information in this report is being provided “as is” for informational purposes only. CISA does not endorse any commercial entity, product, company, or service, including any entities, products, or services linked within this document. Any reference to specific commercial entities, products, processes, or services by service mark, trademark, manufacturer, or otherwise, does not constitute or imply endorsement, recommendation, or favoring by CISA. </p>\n<h2><strong>Notes</strong>&nbsp;</h2>\n<p><a class=\"ck-anchor\" id=\"note1\">1</a> Cisco Security, “Cisco Catalyst SD-WAN Hardening Guide,” last modified February 9, 2026, <a href=\"https://sec.cloudapps.cisco.com/security/center/resources/Cisco-Catalyst-SD-WAN-HardeningGuide\">https://sec.cloudapps.cisco.com/security/center/resources/Cisco-Catalyst-SD-WAN-HardeningGuide</a></p>\n",
  "source": "CISA US-CERT",
  "timestamp": "2026-02-25T23:00:07.736Z",
  "severity_score": 9,
  "severity_level": "CRITICAL",
  "is_pre_analyzed": true,
  "summary": "미 사이버보안 및 인프라 보안국(CISA)과 NSA를 포함한 국제 파트너들은 Cisco SD-WAN 시스템을 대상으로 한 전 세계적인 사이버 공격 활동에 대해 긴급 경보를 발령했습니다. 이번 위협은 기업 네트워크의 핵심 허브 역할을 하는 SD-WAN 컨트롤러를 표적으로 삼고 있으며, 공격자가 네트워크 트래픽 전체를 제어하거나 장기적인 침투를 유지할 수 있다는 점에서 그 위험성이 매우 높습니다. 특히 CISA는 해당 취약점들을 '알려진 악용된 취약점(KEV)' 목록에 추가하고 연방 민간 행정부(FCEB) 기관에 긴급 지침(ED 26-03)을 하달하여 즉각적인 조치를 요구했습니다.\n\n기술적으로 공격자들은 취약점 체이닝(Vulnerability Chaining) 기법을 사용합니다. 먼저 인증 우회 취약점인 CVE-2026-20127을 통해 시스템에 초기 접근한 뒤, 연이어 권한 상승 취약점인 CVE-2022-20775를 악용하여 관리자 권한을 획득합니다. 이러한 과정은 공격자가 시스템 내에서 장기적인 지속성(Persistence)을 확보하고 탐지를 회피하며 네트워크 내부로 확산하기 위한 고도화된 위협(APT) 전략의 일환으로 분석됩니다.\n\n이번 취약점 악용으로 인해 Cisco SD-WAN을 사용하는 전 세계 정부 기관 및 기업들이 직접적인 위협에 노출되었습니다. SD-WAN 시스템이 침해될 경우, 공격자는 암호화된 트래픽을 가로채거나 네트워크 경로를 조작하여 중간자 공격(MitM)을 수행할 수 있습니다. 이는 기밀 데이터 유출뿐만 아니라 국가 안보와 직결된 인프라의 운영 중단을 초래할 수 있는 심각한 위협입니다.\n\n대응을 위해 모든 조직은 즉시 보유 중인 Cisco SD-WAN 시스템 자산을 전수 조사하고 가용한 모든 패치를 즉각 적용해야 합니다. 또한 CISA와 파트너사가 배포한 '위협 헌팅 가이드'를 활용하여 가상 스냅샷 및 로그 분석을 통한 침해 흔적 조사를 수행해야 합니다. 네트워크 경계 보안 강화, VPN 인터페이스 격리, 원격 Syslog 서버 활용 등 Cisco의 하드닝 가이드를 준수하는 것이 향후 추가적인 피해를 예방하는 데 필수적입니다.",
  "tags": [
    "Cisco SD-WAN",
    "Authentication Bypass",
    "Privilege Escalation",
    "CISA KEV",
    "APT"
  ],
  "references": [
    "CVE-2026-20127",
    "CVE-2022-20775",
    "CISA, Emergency Directive (ED) 26-03: Mitigate Vulnerabilities in Cisco SD-WAN Systems, 2026",
    "MITRE ATT&CK: T1190 - Exploit Public-Facing Application",
    "Cisco Systems, Cisco Catalyst SD-WAN Hardening Guide, 2026"
  ],
  "is_analyzed": true
}