{
  "id": "009173de-90a6-471a-9f7b-fa4163564bdd",
  "title": "Russia-Aligned Hackers Abuse Viber to Target Ukrainian Military and Government",
  "url": "https://thehackernews.com/2026/01/russia-aligned-hackers-abuse-viber-to.html",
  "content": "The Russia-aligned threat actor known as UAC-0184 has been observed targeting Ukrainian military and government entities by leveraging the Viber messaging platform to deliver malicious ZIP archives.\n\"This organization has continued to conduct high-intensity intelligence gathering activities against Ukrainian military and government departments in 2025,\" the 360 Threat Intelligence Center said in",
  "source": "The Hacker News",
  "timestamp": "2026-01-05T18:21:08.911Z",
  "summary": "Executive Overview: UAC-0184, a threat actor aligned with Russian interests, is engaged in a high-intensity cyber espionage campaign targeting Ukrainian military and government entities throughout 2025. This group leverages unconventional initial access vectors, specifically the Viber messaging platform, to circumvent traditional security perimeters and establish a foothold within strategic networks. Threat Analysis: The group utilizes social engineering to deliver malicious ZIP archives via direct messages. Upon extraction, these archives deploy modular malware designed for intelligence collection. This methodology highlights a tactical shift toward Instant Messaging (IM) platforms, which often lack the rigorous inspection and attachment filtering found in enterprise email gateways. The use of ZIP files facilitates the evasion of basic signature-based detection and relies on user interaction to execute the payload. Impact Assessment: The compromise of Ukrainian military and government systems poses a severe threat to operational security and national integrity. Potential outcomes include the exfiltration of classified tactical data, disruption of command-and-control communication, and long-term persistence within critical infrastructure. The high focus on intelligence gathering suggests an intent to inform kinetic operations or political maneuvers. Recommendations: Organizations must enforce robust endpoint security policies, including the restriction of unauthorized messaging applications on government-issued devices. It is essential to deploy advanced behavior-based detection for archive extraction and suspicious child-process creation. Additionally, specialized cyber hygiene training should be provided to personnel to recognize and report unsolicited attachments received via mobile or desktop messaging platforms.",
  "severity_score": 8.5,
  "severity_level": "HIGH",
  "tags": [
    "Espionage",
    "UAC-0184",
    "Social Engineering",
    "Malware Delivery",
    "Messaging Apps"
  ],
  "references": [
    "360 Threat Intelligence Center, UAC-0184 Activity Report: High-Intensity Intelligence Gathering, 2025",
    "MITRE ATT&CK: T1566.003",
    "CERT-UA, Technical Analysis of UAC-0184 Phishing Campaigns, State Service of Special Communications of Ukraine, 2024",
    "Garg et al., The evolution of messaging-based social engineering in hybrid warfare, IEEE Security and Privacy, 2023",
    "MITRE ATT&CK: T1204.002"
  ],
  "is_analyzed": true
}