{
  "id": "0af9123f-a361-4e99-afed-a4dec1c9d5b9",
  "title": "New Exploits for Unsecure SAP Systems",
  "url": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa19-122a",
  "content": "<div>\n<h2><strong>Summary</strong></h2>\n</div>\n<p>The Cybersecurity and Infrastructure Security Agency (CISA) is issuing this activity alert in response to recently disclosed exploits that target unsecure configurations of SAP components. [<a href=\"https://github.com/msuiche/OPCDE/tree/master/2019/Emirates/(SAP)%20Gateway%20to%20Heaven%20-%20Dmitry%20Chastuhin%2C%20Mathieu%20Geli\" title=\"(SAP) Gateway to Heaven - Dmitry Chastuhin, Mathieu Geli\">1</a>]</p>\n<div>\n<h2><strong>Technical Details</strong></h2>\n</div>\n<p>A presentation at the April 2019 Operation for Community Development and Empowerment (OPCDE) cybersecurity conference describes SAP systems with unsecure configurations exposed to the internet. Typically, SAP systems are not intended to be exposed to the internet as it is an untrusted network. Malicious cyber actors can attack and compromise these unsecure systems with publicly available exploit tools, termed “10KBLAZE.” The presentation details the new exploit tools and reports on systems exposed to the internet.</p>\n<h3>SAP Gateway ACL</h3>\n<p>The SAP Gateway allows non-SAP applications to communicate with SAP applications. If SAP Gateway access control lists (ACLs) are not configured properly (e.g., gw/acl_mode = 0), anonymous users can run operating system (OS) commands.[2] According to the OPCDE presentation, about 900 U.S. internet-facing systems were detected in this vulnerable condition.</p>\n<h3>SAP Router secinfo</h3>\n<p>The SAP router is a program that helps connect SAP systems with external networks. The default <code>secinfo</code> configuration for a SAP Gateway allows any internal host to run OS commands anonymously. If an attacker can access a misconfigured SAP router, the router can act as an internal host and proxy the attacker’s requests, which may result in remote code execution.</p>\n<p>According to the OPCDE presentation, 1,181 SAP routers were exposed to the internet. It is unclear if the exposed systems were confirmed to be vulnerable or were simply running the SAP router service.</p>\n<h3>SAP Message Server</h3>\n<p>SAP Message Servers act as brokers between Application Servers (AS). By default, Message Servers listen on a port 39XX and have no authentication. If an attacker can access a Message Server, they can redirect and/or execute legitimate man-in-the-middle (MITM) requests, thereby gaining credentials. Those credentials can be used to execute code or operations on AS servers (assuming the attacker can reach them). According to the OPCDE presentation, there are 693 Message Servers exposed to the internet in the United States. The Message Server ACL must be protected by the customer in all releases.</p>\n<h3>Signature</h3>\n<p>CISA worked with security researchers from Onapsis Inc.[<a href=\"https://www.onapsis.com/\" title=\"Onapsis\">3</a>] to develop the following Snort signature that can be used to detect the exploits:</p>\n<p><code>alert tcp $EXTERNAL_NET any -&gt; $HOME_NET any (msg:\"10KBLAZE SAP Exploit execute attempt\"; flow:established,to_server; content:\"|06 cb 03|\"; offset:4; depth:3; content:\"SAPXPG_START_XPG\"; nocase; distance:0; fast_pattern; content:\"37D581E3889AF16DA00A000C290099D0001\"; nocase; distance:0; content:\"extprog\"; nocase; distance:0; sid:1; rev:1;)</code></p>\n<h2><strong>Mitigations</strong></h2>\n<p>CISA recommends administrators of SAP systems implement the following to mitigate the vulnerabilities included in the OPCDE presentation:</p>\n<ul>\n<li>Ensure a secure configuration of their SAP landscape.</li>\n<li>Restrict access to SAP Message Server.\n<ul>\n<li>Review SAP Notes 1408081 and 821875. Restrict authorized hosts via ACL files on Gateways (<code>gw/acl_mode </code>and <code>secinfo</code>) and Message Servers (<code>ms/acl_info</code>).[4], [5]</li>\n<li>Review SAP Note 1421005. Split MS internal/public:<code> rdisp/msserv=0 rdisp/msserv_internal=39NN</code>. [6]</li>\n<li>Restrict access to Message Server internal port (<code>tcp/39NN</code>) to clients or the internet.</li>\n<li>Enable Secure Network Communications (SNC) for clients.</li>\n</ul>\n</li>\n<li>Scan for exposed SAP components.\n<ul>\n<li>Ensure that SAP components are not exposed to the internet.</li>\n<li>Remove or secure any exposed SAP components.</li>\n</ul>\n</li>\n</ul>\n<div>\n<h2><strong>References</strong></h2>\n<p>[1] <a href=\"https://github.com/msuiche/OPCDE/tree/master/2019/Emirates/(SAP)%20Gateway%20to%20Heaven%20-%20Dmitry%20Chastuhin%2C%20Mathieu%20Geli\" title=\"(SAP) Gateway to Heaven - Dmitry Chastuhin, Mathieu Geli\">Comae Technologies: Operation for Community Development and Empowerment (OPCDE) Cybersecurity Conference Materials</a><br>[2] SAP: Gateway Access Control Lists<br>[3] <a href=\"https://www.onapsis.com\" title=\"Onapsis\">Onapsis Inc. website</a><br>[4] SAP Note 1408081<br>[5] SAP Note 821875<br>[6] SAP Note 1421005</p>\n<h2><strong>Revisions</strong></h2>\n</div>\n<p><strong>May 2, 2019:</strong> Initial version</p>\n",
  "source": "CISA US-CERT",
  "timestamp": "2026-01-05T18:26:44.731Z",
  "summary": "Executive Overview: The Cybersecurity and Infrastructure Security Agency (CISA) has identified a high-risk scenario involving the 10KBLAZE exploit suite, which targets fundamental misconfigurations within SAP components. These exploits focus on the SAP Gateway, Router, and Message Server, capitalizing on legacy default settings that leave systems exposed to the public internet. Because SAP environments typically process mission-critical business data, including financial records and human resources information, the exposure of these systems poses a direct threat to corporate governance and operational continuity. Threat Analysis: Technical analysis reveals that the 10KBLAZE tools exploit the lack of proper Access Control Lists (ACLs). Specifically, if gw/acl_mode is set to 0, an unauthenticated attacker can execute operating system commands via the SAP Gateway. Furthermore, the SAP Message Server often listens on port 39XX without authentication, facilitating Man-in-the-Middle (MITM) attacks and credential theft. The SAP Router, if misconfigured, serves as a gateway for attackers to bypass perimeter defenses and interact with internal application servers as if they were trusted hosts. Impact Assessment: Compromise of these systems can lead to full Remote Code Execution (RCE) and lateral movement within the enterprise network. With over 2,000 systems identified as exposed in initial scans, the potential for widespread data breaches and ransomware deployment is significant. The impact is exacerbated by the fact that these are not software bugs but architectural oversights, requiring manual administrative intervention rather than simple patching. Recommendations: Administrators must immediately audit and restrict access via SAP Notes 1408081, 821875, and 1421005. Key actions include disabling anonymous OS command execution, restricting port 39NN to internal traffic, and implementing Secure Network Communications (SNC). Organizations should leverage the Snort signatures developed by CISA and Onapsis to monitor for exploitation attempts and ensure no SAP components are accessible from untrusted networks.",
  "severity_score": 9,
  "severity_level": "CRITICAL",
  "tags": [
    "10KBLAZE",
    "SAP Security",
    "Remote Code Execution",
    "Misconfiguration",
    "ERP Security"
  ],
  "references": [
    "Chastuhin, D. & Geli, M., (SAP) Gateway to Heaven, OPCDE, 2019",
    "MITRE ATT&CK: T1210 - Exploitation of Remote Services",
    "CISA Alert AA19-122A, New Exploits for Unsecure SAP Systems, 2019",
    "Onapsis Research, The 10KBLAZE Exploits: How to Protect your SAP Landscape, 2019"
  ],
  "is_analyzed": true
}