{
  "id": "0af9123f-a361-4e99-afed-a4dec1c9d5b9",
  "title": "New Exploits for Unsecure SAP Systems",
  "url": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa19-122a",
  "content": "<div>\n<h2><strong>Summary</strong></h2>\n</div>\n<p>The Cybersecurity and Infrastructure Security Agency (CISA) is issuing this activity alert in response to recently disclosed exploits that target unsecure configurations of SAP components. [<a href=\"https://github.com/msuiche/OPCDE/tree/master/2019/Emirates/(SAP)%20Gateway%20to%20Heaven%20-%20Dmitry%20Chastuhin%2C%20Mathieu%20Geli\" title=\"(SAP) Gateway to Heaven - Dmitry Chastuhin, Mathieu Geli\">1</a>]</p>\n<div>\n<h2><strong>Technical Details</strong></h2>\n</div>\n<p>A presentation at the April 2019 Operation for Community Development and Empowerment (OPCDE) cybersecurity conference describes SAP systems with unsecure configurations exposed to the internet. Typically, SAP systems are not intended to be exposed to the internet as it is an untrusted network. Malicious cyber actors can attack and compromise these unsecure systems with publicly available exploit tools, termed “10KBLAZE.” The presentation details the new exploit tools and reports on systems exposed to the internet.</p>\n<h3>SAP Gateway ACL</h3>\n<p>The SAP Gateway allows non-SAP applications to communicate with SAP applications. If SAP Gateway access control lists (ACLs) are not configured properly (e.g., gw/acl_mode = 0), anonymous users can run operating system (OS) commands.[2] According to the OPCDE presentation, about 900 U.S. internet-facing systems were detected in this vulnerable condition.</p>\n<h3>SAP Router secinfo</h3>\n<p>The SAP router is a program that helps connect SAP systems with external networks. The default <code>secinfo</code> configuration for a SAP Gateway allows any internal host to run OS commands anonymously. If an attacker can access a misconfigured SAP router, the router can act as an internal host and proxy the attacker’s requests, which may result in remote code execution.</p>\n<p>According to the OPCDE presentation, 1,181 SAP routers were exposed to the internet. It is unclear if the exposed systems were confirmed to be vulnerable or were simply running the SAP router service.</p>\n<h3>SAP Message Server</h3>\n<p>SAP Message Servers act as brokers between Application Servers (AS). By default, Message Servers listen on a port 39XX and have no authentication. If an attacker can access a Message Server, they can redirect and/or execute legitimate man-in-the-middle (MITM) requests, thereby gaining credentials. Those credentials can be used to execute code or operations on AS servers (assuming the attacker can reach them). According to the OPCDE presentation, there are 693 Message Servers exposed to the internet in the United States. The Message Server ACL must be protected by the customer in all releases.</p>\n<h3>Signature</h3>\n<p>CISA worked with security researchers from Onapsis Inc.[<a href=\"https://www.onapsis.com/\" title=\"Onapsis\">3</a>] to develop the following Snort signature that can be used to detect the exploits:</p>\n<p><code>alert tcp $EXTERNAL_NET any -&gt; $HOME_NET any (msg:\"10KBLAZE SAP Exploit execute attempt\"; flow:established,to_server; content:\"|06 cb 03|\"; offset:4; depth:3; content:\"SAPXPG_START_XPG\"; nocase; distance:0; fast_pattern; content:\"37D581E3889AF16DA00A000C290099D0001\"; nocase; distance:0; content:\"extprog\"; nocase; distance:0; sid:1; rev:1;)</code></p>\n<h2><strong>Mitigations</strong></h2>\n<p>CISA recommends administrators of SAP systems implement the following to mitigate the vulnerabilities included in the OPCDE presentation:</p>\n<ul>\n<li>Ensure a secure configuration of their SAP landscape.</li>\n<li>Restrict access to SAP Message Server.\n<ul>\n<li>Review SAP Notes 1408081 and 821875. Restrict authorized hosts via ACL files on Gateways (<code>gw/acl_mode </code>and <code>secinfo</code>) and Message Servers (<code>ms/acl_info</code>).[4], [5]</li>\n<li>Review SAP Note 1421005. Split MS internal/public:<code> rdisp/msserv=0 rdisp/msserv_internal=39NN</code>. [6]</li>\n<li>Restrict access to Message Server internal port (<code>tcp/39NN</code>) to clients or the internet.</li>\n<li>Enable Secure Network Communications (SNC) for clients.</li>\n</ul>\n</li>\n<li>Scan for exposed SAP components.\n<ul>\n<li>Ensure that SAP components are not exposed to the internet.</li>\n<li>Remove or secure any exposed SAP components.</li>\n</ul>\n</li>\n</ul>\n<div>\n<h2><strong>References</strong></h2>\n<p>[1] <a href=\"https://github.com/msuiche/OPCDE/tree/master/2019/Emirates/(SAP)%20Gateway%20to%20Heaven%20-%20Dmitry%20Chastuhin%2C%20Mathieu%20Geli\" title=\"(SAP) Gateway to Heaven - Dmitry Chastuhin, Mathieu Geli\">Comae Technologies: Operation for Community Development and Empowerment (OPCDE) Cybersecurity Conference Materials</a><br>[2] SAP: Gateway Access Control Lists<br>[3] <a href=\"https://www.onapsis.com\" title=\"Onapsis\">Onapsis Inc. website</a><br>[4] SAP Note 1408081<br>[5] SAP Note 821875<br>[6] SAP Note 1421005</p>\n<h2><strong>Revisions</strong></h2>\n</div>\n<p><strong>May 2, 2019:</strong> Initial version</p>\n",
  "source": "CISA US-CERT",
  "timestamp": "2026-01-05T18:26:44.731Z",
  "summary": "[Executive Overview] 2019년 OPCDE 컨퍼런스에서 공개된 '10KBLAZE' 엑스플로잇은 보안 설정이 미흡한 SAP 구성 요소를 표적으로 삼으며, 전 세계 엔터프라이즈 자원 관리(ERP) 환경에 심각한 위협을 제기합니다. CISA는 인터넷에 노출된 SAP 시스템이 공격자의 손쉬운 타겟이 되어 비즈니스 연속성을 해칠 수 있음을 경고했습니다. [Threat Analysis] 공격의 핵심은 SAP Gateway, Router, Message Server의 ACL(접근 제어 목록) 및 설정 파일(secinfo)의 구성 오류를 악용하는 것입니다. 공격자는 이를 통해 인증 없이 운영 체제 명령을 실행(RCE)하거나 중간자 공격(MITM)을 수행하여 민감한 자격 증명을 탈취할 수 있습니다. 특히 10KBLAZE 도구는 이러한 취약한 설정을 자동으로 탐색하고 공격할 수 있도록 설계되었습니다. [Impact Assessment] SAP 시스템은 기업의 핵심 비즈니스 데이터를 처리하므로, 침해 시 전사적 데이터 유출, 재무 기록 조작 및 업무 중단과 같은 치명적인 피해가 발생합니다. 조사 결과 수천 개의 시스템이 취약한 상태로 인터넷에 노출되어 있어 대규모 공급망 위협으로 발전할 가능성이 확인되었습니다. [Recommendations] 관리자는 즉시 SAP Note 1408081 및 1421005를 적용하여 ACL 설정을 강화하고, SNC(Secure Network Communications)를 활성화해야 합니다. 또한 SAP 구성 요소의 인터넷 직접 노출을 전면 차단하고 Onapsis에서 제공한 Snort 탐지 시그니처를 활용한 능동적인 보안 모니터링 체계를 구축해야 합니다.",
  "severity_score": 9.5,
  "severity_level": "CRITICAL",
  "tags": [
    "SAP Security",
    "Remote Code Execution (RCE)",
    "Misconfiguration",
    "10KBLAZE",
    "CISA Advisory"
  ],
  "references": [
    "Dmitry Chastuhin and Mathieu Geli, (SAP) Gateway to Heaven, OPCDE Conference, 2019",
    "MITRE ATT&CK: T1190 (Exploit Public-Facing Application)",
    "CISA Alert (AA19-122A), New Exploits for Unsecure SAP Systems, 2019",
    "Onapsis Inc., The 10KBLAZE Threat Report, 2019",
    "SAP Security Note 1408081 (Access Control Lists in SAP Gateway)"
  ],
  "is_analyzed": true
}