{
  "id": "0cb02952-f005-4d65-9a67-e434f932d3ed",
  "title": "DNS Infrastructure Hijacking Campaign",
  "url": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa19-024a",
  "content": "<div>\n<h2><strong>Summary</strong></h2>\n</div>\n<p>The National Cybersecurity and Communications Integration Center (NCCIC), part of the Cybersecurity and Infrastructure Security Agency (CISA), is aware of a global Domain Name System (DNS) infrastructure hijacking campaign. Using compromised credentials, an attacker can modify the location to which an organization’s domain name resources resolve. This enables the attacker to redirect user traffic to attacker-controlled infrastructure and obtain valid encryption certificates for an organization’s domain names, enabling man-in-the-middle attacks.</p>\n<p>See the following links for downloadable copies of open-source&nbsp;indicators of compromise&nbsp;(IOCs) from the sources listed in the References section below:</p>\n<ul>\n<li><a href=\"https://www.cisa.gov/sites/default/files/publications/AA19-024A_IOCs.csv\">IOCs (.csv)</a></li>\n<li><a href=\"https://www.cisa.gov/sites/default/files/publications/AA19-024A_IOCs.stix.xml\">IOCs (.stix)</a></li>\n</ul>\n<p>Note: these files were last updated February 13, 2019, to remove the following three&nbsp;non-malicious IP addresses:</p>\n<ul>\n<li>107.161.23.204</li>\n<li>192.161.187.200</li>\n<li>209.141.38.71</li>\n</ul>\n<div>\n<h2><strong>Technical Details</strong></h2>\n</div>\n<p>Using the following techniques, attackers have redirected and intercepted web and mail traffic, and could do so for other networked services.</p>\n<ol>\n<li>The attacker begins by compromising user credentials, or obtaining them through alternate means, of an account that can make changes to DNS records.</li>\n<li>Next, the attacker alters DNS records, like Address (A), Mail Exchanger (MX), or Name Server (NS) records, replacing the legitimate address of a service with an address the attacker controls. This enables them to direct user traffic to their own infrastructure for manipulation or inspection before passing it on to the legitimate service, should they choose. This creates a risk that persists beyond the period of traffic redirection.</li>\n<li>Because the attacker can set DNS record values, they can also obtain valid encryption certificates for an organization’s domain names. This allows the redirected traffic to be decrypted, exposing any user-submitted data. Since the certificate is valid for the domain, end users receive no error warnings.</li>\n</ol>\n<div>\n<h2><strong>Mitigations</strong></h2>\n</div>\n<p>NCCIC recommends the following best practices to help safeguard networks against this threat:</p>\n<ul>\n<li>Update the passwords for all accounts that can change organizations’ DNS records.</li>\n<li>Implement multifactor authentication on domain registrar accounts, or on other systems used to modify DNS records.</li>\n<li>Audit public DNS records to verify they are resolving to the intended location.</li>\n<li>Search for encryption certificates related to domains and revoke any fraudulently requested certificates.</li>\n</ul>\n<div>\n<h2><strong>References</strong></h2>\n<ul>\n<li><a href=\"https://blog.talosintelligence.com/dnspionage-campaign-targets-middle-east/\" title=\"DNSpionage Campaign Targets Middle East\">Cisco Talos blog: DNSpionage Campaign Targets Middle East</a></li>\n<li>CERT-OPMD blog: [DNSPIONAGE] – Focus on internal actions</li>\n<li><a href=\"https://cloud.google.com/blog/topics/threat-intelligence/global-dns-hijacking-campaign-dns-record-manipulation-at-scale/\" title=\"Global DNS Hijacking Campaign: DNS Record Manipulation at Scale\">Global DNS Hijacking Campaign: DNS Record Manipulation at Scale | Mandiant | Google Cloud Blog</a></li>\n<li>Crowdstrike blog: Widespread DNS Hijacking Activity Targets Multiple Sectors</li>\n</ul>\n<h2><strong>Revisions</strong></h2>\n</div>\n<p><strong>January 24, 2019:</strong> Initial version<br><strong>February 6, 2019:</strong> Updated IOCs, added Crowdstrike blog<br><strong>February 13, 2019:</strong> Updated IOCs</p>\n",
  "source": "CISA US-CERT",
  "timestamp": "2026-01-05T18:08:42.063Z",
  "summary": "A global DNS infrastructure hijacking campaign uses compromised credentials to modify DNS records, allowing attackers to redirect traffic and obtain valid encryption certificates for stealthy man-in-the-middle attacks.",
  "severity_score": 9,
  "severity_level": "CRITICAL",
  "tags": [
    "DNS Hijacking",
    "Man-in-the-Middle",
    "Credential Theft",
    "DNSpionage",
    "CISA Alert"
  ],
  "is_analyzed": true
}