{
  "id": "6ebfc325-eaa1-4d5a-b9fd-7aac83c589d0",
  "title": "SamSam Ransomware",
  "url": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa18-337a",
  "content": "<div>\n<h2><strong>Summary</strong></h2>\n</div>\n<p>The Department of Homeland Security (DHS) National Cybersecurity and Communications Integration Center (NCCIC) and the Federal Bureau of Investigation (FBI) are issuing this activity alert to inform computer network defenders about SamSam ransomware, also known as MSIL/Samas.A. Specifically, this product shares analysis of vulnerabilities that cyber actors exploited to deploy this ransomware. In addition, this report provides recommendations for prevention and mitigation.</p>\n<p>The SamSam actors targeted multiple industries, including some within critical infrastructure. Victims were located predominately in the United States, but also internationally. Network-wide infections against organizations are far more likely to garner large ransom payments than infections of individual systems. Organizations that provide essential functions have a critical need to resume operations quickly and are more likely to pay larger ransoms.</p>\n<p>The actors exploit Windows servers to gain persistent access to a victim’s network and infect all reachable hosts. According to reporting from victims in early 2016, cyber actors used the JexBoss Exploit Kit to access vulnerable JBoss applications. Since mid-2016, FBI analysis of victims’ machines indicates that cyber actors use Remote Desktop Protocol (RDP) to gain persistent access to victims’ networks. Typically, actors either use brute force attacks or stolen login credentials. Detecting RDP intrusions can be challenging because the malware enters through an approved access point.</p>\n<p>After gaining access to a particular network, the SamSam actors escalate privileges for administrator rights, drop malware onto the server, and run an executable file, all without victims’ action or authorization. While many ransomware campaigns rely on a victim completing an action, such as opening an email or visiting a compromised website, RDP allows cyber actors to infect victims with minimal detection.</p>\n<p>Analysis of tools found on victims’ networks indicated that successful cyber actors purchased several of the stolen RDP credentials from known darknet marketplaces. FBI analysis of victims’ access logs revealed that the SamSam actors can infect a network within hours of purchasing the credentials. While remediating infected systems, several victims found suspicious activity on their networks unrelated to SamSam. This activity is a possible indicator that the victims’ credentials were stolen, sold on the darknet, and used for other illegal activity.</p>\n<p>SamSam actors leave ransom notes on encrypted computers. These instructions direct victims to establish contact through a Tor hidden service site. After paying the ransom in Bitcoin and establishing contact, victims usually receive links to download cryptographic keys and tools to decrypt their network.</p>\n<div>\n<h2><strong>Technical Details</strong></h2>\n</div>\n<p>NCCIC recommends organizations review the following SamSam Malware Analysis Reports. The reports represent four SamSam malware variants. This is not an exhaustive list.</p>\n<ul>\n<li><a href=\"https://www.cisa.gov/ncas/analysis-reports/AR18-337A\">MAR-10219351.r1.v2 – SamSam1</a></li>\n<li><a href=\"https://www.cisa.gov/ncas/analysis-reports/AR18-337B\">MAR-10166283.r1.v1 – SamSam2</a></li>\n<li><a href=\"https://www.cisa.gov/ncas/analysis-reports/AR18-337C\">MAR-10158513.r1.v1 – SamSam3</a></li>\n<li><a href=\"https://www.cisa.gov/ncas/analysis-reports/AR18-337D\">MAR-10164494.r1.v1 – SamSam4</a></li>\n</ul>\n<p>For general information on ransomware, see the NCCIC Security Publication at <a href=\"https://www.cisa.gov/stopransomware\" title=\"#StopRansomware\">Stop Ransomware</a>.</p>\n<div>\n<h2><strong>Mitigations</strong></h2>\n</div>\n<p>DHS and FBI recommend that users and administrators consider using the following best practices to strengthen the security posture of their organization's systems. System owners and administrators should review any configuration changes before implementation to avoid unwanted impacts.</p>\n<ul>\n<li>Audit your network for systems that use RDP for remote communication. Disable the service if unneeded or install available patches. Users may need to work with their technology venders to confirm that patches will not affect system processes.</li>\n<li>Verify that all cloud-based virtual machine instances with public IPs have no open RDP ports, especially port 3389, unless there is a valid business reason to keep open RDP ports. Place any system with an open RDP port behind a firewall and require users to use a virtual private network (VPN) to access that system.</li>\n<li>Enable strong passwords and account lockout policies to defend against brute force attacks.</li>\n<li>Where possible, apply two-factor authentication.</li>\n<li>Regularly apply system and software updates.</li>\n<li>Maintain a good back-up strategy.</li>\n<li>Enable logging and ensure that logging mechanisms capture RDP logins. Keep logs for a minimum of 90 days and review them regularly to detect intrusion attempts.</li>\n<li>When creating cloud-based virtual machines, adhere to the cloud provider’s best practices for remote access.</li>\n<li>Ensure that third parties that require RDP access follow internal policies on remote access.</li>\n<li>Minimize network exposure for all control system devices. Where possible, disable RDP on critical devices.</li>\n<li>Regulate and limit external-to-internal RDP connections. When external access to internal resources is required, use secure methods such as VPNs. Of course, VPNs are only as secure as the connected devices.</li>\n<li>Restrict users' ability (permissions) to install and run unwanted software applications.</li>\n<li>Scan for and remove suspicious email attachments; ensure the scanned attachment is its \"true file type\" (i.e., the extension matches the file header).</li>\n<li>Disable file and printer sharing services. If these services are required, use strong passwords or Active Directory authentication.</li>\n</ul>\n<p>Additional information on malware incident prevention and handling can be found in Special Publication 800-83, <em>Guide to Malware Incident Prevention and Handling for Desktops and Laptops</em>, from the National Institute of Standards and Technology.[<a href=\"https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-83r1.pdf\" title=\"NIST SP 800-83: Guide to Malware Incident Prevention and Handling for Desktops and Laptops\">1</a>]</p>\n<div>\n<h2><strong>Contact Information</strong></h2>\n</div>\n<p>To report an intrusion and request resources for incident response or technical assistance, contact NCCIC, FBI, or the FBI’s Cyber Division via the following information:</p>\n<ul>\n<li>NCCIC\n<ul>\n<li><a href=\"mailto:SayCISA@cisa.dhs.gov\" title=\"Report to CISA\">SayCISA@cisa.dhs.gov</a></li>\n<li>1-844-Say-CISA</li>\n</ul>\n</li>\n<li>FBI’s Cyber Division\n<ul>\n<li><a href=\"mailto:CyWatch@fbi.gov\">CyWatch@fbi.gov</a></li>\n<li>855-292-3937</li>\n</ul>\n</li>\n<li>FBI through a <a href=\"https://www.fbi.gov/contact-us/field-offices\" title=\"local field office\">local field office</a></li>\n</ul>\n<h2><strong>Feedback</strong></h2>\n<p>DHS strives to make this report a valuable tool for our partners and welcomes feedback on how this publication could be improved. You can help by answering a few short questions about this report at the following URL: <a href=\"https://www.cisa.gov/forms/feedback\" title=\"CISA Website Feedback\">Website Feedback</a>.</p>\n<div>\n<h2><strong>References</strong></h2>\n<p>[1] <a href=\"https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-83r1.pdf\" title=\"NIST SP 800-83: Guide to Malware Incident Prevention and Handling for Desktops and Laptops\">NIST SP 800-83: Guide to Malware Incident Prevention and Handling for Desktops and Laptops</a></p>\n</div>\n<div>\n<h2><strong>Revisions</strong></h2>\n</div>\n<p><strong>December 3, 2018:</strong> Initial version</p>\n",
  "source": "CISA US-CERT",
  "timestamp": "2026-01-05T18:26:44.728Z",
  "summary": "Executive Overview: SamSam, also known as MSIL/Samas.A, represents a shift from opportunistic to highly targeted ransomware operations. Since 2016, it has focused on organizations within critical infrastructure, government, and healthcare sectors, particularly in the United States. Its manual deployment strategy distinguishes it from self-propagating worms, allowing attackers to maximize impact and demand significant ransom payments from organizations with low downtime tolerance. Threat Analysis: The threat actors utilize a multi-stage attack vector. Initially, they exploited JBoss application vulnerabilities using the JexBoss Exploit Kit, but shifted toward Remote Desktop Protocol (RDP) exploitation. Access is gained through brute-force attacks or purchasing stolen credentials from darknet markets. Once inside, attackers perform lateral movement and privilege escalation to gain administrator rights before manually deploying the ransomware executable across all reachable hosts via the internal network. Impact Assessment: The primary impact is total operational paralysis through network-wide encryption. Because SamSam targets essential service providers, the consequences often include the cessation of public services, loss of critical patient data in healthcare, and massive remediation costs that often exceed the ransom demands. Furthermore, the presence of SamSam often indicates a broader compromise of credentials that may have been sold multiple times on the dark web. Recommendations: Organizations must secure RDP by placing it behind a VPN, enforcing Multi-Factor Authentication (MFA), and implementing account lockout policies to thwart brute-force attempts. Regular patching of internet-facing applications, particularly legacy JBoss installations, is vital. Maintaining offline, immutable backups and implementing comprehensive logging for RDP sessions (90-day minimum) are critical for detection and recovery.",
  "severity_score": 8.5,
  "severity_level": "CRITICAL",
  "tags": [
    "Ransomware",
    "RDP",
    "Targeted Attacks",
    "Credential Theft",
    "JBoss"
  ],
  "references": [
    "CISA, Alert (AA18-337A): SamSam Ransomware, 2018",
    "S. Al-rimy et al., A Survey on Ransomware: A Review of Emerging Ransomware Variants and Defensive Mechanisms, IEEE Access, 2018",
    "MITRE ATT&CK: T1133 External Remote Services",
    "Sophos, SamSam: The $6 Million Ransomware, 2018",
    "NIST SP 800-83 Rev. 1, Guide to Malware Incident Prevention and Handling for Desktops and Laptops, 2013"
  ],
  "is_analyzed": true
}