{
  "id": "7910f2a2-6eb7-4313-bf5b-4d72d71150ee",
  "title": "DNS Infrastructure Hijacking Campaign",
  "url": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa19-024a",
  "content": "<div>\n<h2><strong>Summary</strong></h2>\n</div>\n<p>The National Cybersecurity and Communications Integration Center (NCCIC), part of the Cybersecurity and Infrastructure Security Agency (CISA), is aware of a global Domain Name System (DNS) infrastructure hijacking campaign. Using compromised credentials, an attacker can modify the location to which an organization’s domain name resources resolve. This enables the attacker to redirect user traffic to attacker-controlled infrastructure and obtain valid encryption certificates for an organization’s domain names, enabling man-in-the-middle attacks.</p>\n<p>See the following links for downloadable copies of open-source&nbsp;indicators of compromise&nbsp;(IOCs) from the sources listed in the References section below:</p>\n<ul>\n<li><a href=\"https://www.cisa.gov/sites/default/files/publications/AA19-024A_IOCs.csv\">IOCs (.csv)</a></li>\n<li><a href=\"https://www.cisa.gov/sites/default/files/publications/AA19-024A_IOCs.stix.xml\">IOCs (.stix)</a></li>\n</ul>\n<p>Note: these files were last updated February 13, 2019, to remove the following three&nbsp;non-malicious IP addresses:</p>\n<ul>\n<li>107.161.23.204</li>\n<li>192.161.187.200</li>\n<li>209.141.38.71</li>\n</ul>\n<div>\n<h2><strong>Technical Details</strong></h2>\n</div>\n<p>Using the following techniques, attackers have redirected and intercepted web and mail traffic, and could do so for other networked services.</p>\n<ol>\n<li>The attacker begins by compromising user credentials, or obtaining them through alternate means, of an account that can make changes to DNS records.</li>\n<li>Next, the attacker alters DNS records, like Address (A), Mail Exchanger (MX), or Name Server (NS) records, replacing the legitimate address of a service with an address the attacker controls. This enables them to direct user traffic to their own infrastructure for manipulation or inspection before passing it on to the legitimate service, should they choose. This creates a risk that persists beyond the period of traffic redirection.</li>\n<li>Because the attacker can set DNS record values, they can also obtain valid encryption certificates for an organization’s domain names. This allows the redirected traffic to be decrypted, exposing any user-submitted data. Since the certificate is valid for the domain, end users receive no error warnings.</li>\n</ol>\n<div>\n<h2><strong>Mitigations</strong></h2>\n</div>\n<p>NCCIC recommends the following best practices to help safeguard networks against this threat:</p>\n<ul>\n<li>Update the passwords for all accounts that can change organizations’ DNS records.</li>\n<li>Implement multifactor authentication on domain registrar accounts, or on other systems used to modify DNS records.</li>\n<li>Audit public DNS records to verify they are resolving to the intended location.</li>\n<li>Search for encryption certificates related to domains and revoke any fraudulently requested certificates.</li>\n</ul>\n<div>\n<h2><strong>References</strong></h2>\n<ul>\n<li><a href=\"https://blog.talosintelligence.com/dnspionage-campaign-targets-middle-east/\" title=\"DNSpionage Campaign Targets Middle East\">Cisco Talos blog: DNSpionage Campaign Targets Middle East</a></li>\n<li>CERT-OPMD blog: [DNSPIONAGE] – Focus on internal actions</li>\n<li><a href=\"https://cloud.google.com/blog/topics/threat-intelligence/global-dns-hijacking-campaign-dns-record-manipulation-at-scale/\" title=\"Global DNS Hijacking Campaign: DNS Record Manipulation at Scale\">Global DNS Hijacking Campaign: DNS Record Manipulation at Scale | Mandiant | Google Cloud Blog</a></li>\n<li>Crowdstrike blog: Widespread DNS Hijacking Activity Targets Multiple Sectors</li>\n</ul>\n<h2><strong>Revisions</strong></h2>\n</div>\n<p><strong>January 24, 2019:</strong> Initial version<br><strong>February 6, 2019:</strong> Updated IOCs, added Crowdstrike blog<br><strong>February 13, 2019:</strong> Updated IOCs</p>\n",
  "source": "CISA US-CERT",
  "timestamp": "2026-01-05T18:26:44.730Z",
  "summary": "[Executive Overview] 최근 CISA와 글로벌 보안 기업들은 'DNSpionage'로 알려진 광범위한 DNS 인프라 하이재킹 캠페인을 경고했습니다. 이 공격은 도메인 이름 시스템(DNS) 관리 권한을 장악하여 합법적인 트래픽을 공격자의 인프라로 리다이렉션하는 고도의 전략을 사용합니다. 이는 인터넷 통신의 신뢰 기반을 무너뜨리는 중대한 위협으로 간주됩니다. [Threat Analysis] 공격자들은 주로 도메인 등록기관 또는 DNS 관리 계정의 자격 증명을 탈취하는 것으로 활동을 시작합니다. 권한을 획득한 후에는 A, MX, NS 레코드를 변조하여 웹 및 이메일 트래픽을 가로챕니다. 특히 공격자는 도메인 제어권을 이용해 유효한 SSL/TLS 인증서를 발급받음으로써, 사용자 브라우저에 경고를 띄우지 않고 암호화된 트래픽을 복호화하는 중간자(MitM) 공격을 수행합니다. [Impact Assessment] 본 캠페인의 피해는 단순히 웹사이트 접속 장애에 그치지 않고 조직의 기밀 정보 유출로 이어집니다. 이메일 서버로 가는 트래픽이 가로채지면 민감한 내부 통신이 노출되며, 유효한 인증서를 통한 복호화 과정에서 사용자의 로그인 정보와 금융 데이터가 탈취될 수 있습니다. 이는 정부 기관 및 민간 기업 모두에게 치명적인 데이터 침해 사고를 야기합니다. [Recommendations] 방어 측면에서 가장 시급한 조치는 DNS 관리 계정에 다요소 인증(MFA)을 필수적으로 도입하는 것입니다. 또한, 정기적인 DNS 레코드 무결성 감사와 인증서 투명성(CT) 로그 모니터링을 통해 미승인 인증서 발급 여부를 확인해야 합니다. 장기적으로는 DNSSEC를 도입하여 응답의 진위 여부를 검증하고 인프라의 보안성을 강화해야 합니다.",
  "severity_score": 9.2,
  "severity_level": "CRITICAL",
  "tags": [
    "DNS Hijacking",
    "DNSpionage",
    "Man-in-the-Middle",
    "Credential Theft"
  ],
  "references": [
    "CISA, Alert (AA19-024A): DNS Infrastructure Hijacking Campaign, 2019",
    "Mandiant, Global DNS Hijacking Campaign: DNS Record Manipulation at Scale, Google Cloud Blog, 2019",
    "MITRE ATT&CK: T1584.004 (Infrastructure Strategy: DNS Server)",
    "Cisco Talos, DNSpionage Campaign Targets Middle East, 2018",
    "Al-Ibrahim et al., DNS-Based Information Exfiltration and Protection Mechanisms, IEEE Access, 2021"
  ],
  "is_analyzed": true
}