{
  "id": "ba92630b-fa46-4276-80c4-517aea51f0bf",
  "title": "Kimwolf Android Botnet Infects Over 2 Million Devices via Exposed ADB and Proxy Networks",
  "url": "https://thehackernews.com/2026/01/kimwolf-android-botnet-infects-over-2.html",
  "content": "The botnet known as Kimwolf has infected more than 2 million Android devices by tunneling through residential proxy networks, according to findings from Synthient.\n\"Key actors involved in the Kimwolf botnet are observed monetizing the botnet through app installs, selling residential proxy bandwidth, and selling its DDoS functionality,\" the company said in an analysis published last week.\nKimwolf",
  "source": "The Hacker News",
  "timestamp": "2026-01-05T18:26:44.634Z",
  "summary": "[Executive Overview] 최근 Synthient가 발표한 보고서에 따르면 Kimwolf로 명명된 안드로이드 봇넷이 전 세계적으로 200만 대 이상의 안드로이드 기기를 감염시켰습니다. 이 봇넷은 주로 노출된 ADB(Android Debug Bridge) 포트를 공격 벡터로 활용하며, 감염된 기기를 주거용 프록시 네트워크의 일부로 편입시켜 금전적 이득을 취하고 있습니다. [Threat Analysis] Kimwolf의 기술적 핵심은 보안 설정이 미흡하여 외부로 노출된 TCP 5555(ADB) 포트를 탐색하고 침투하는 것입니다. 공격자는 이를 통해 기기에 침투한 후 악성 페이로드를 실행하여 기기를 봇넷에 등록합니다. 특히 이들은 감염된 기기의 네트워크 대역폭을 주거용 프록시 서비스로 재판매하거나, 광고 사기(Ad Fraud), 앱 자동 설치, 대규모 DDoS 공격 수행 등의 수단으로 활용하고 있습니다. [Impact Assessment] 200만 대 이상의 거대 봇넷은 개별 사용자에게는 성능 저하 및 배터리 소모를 유발하지만, 사회적으로는 대규모 사이버 공격의 인프라로 작용합니다. 주거용 프록시로 위장된 공격 트래픽은 일반 사용자의 IP 주소를 사용하므로 보안 장비의 IP 기반 차단을 무력화할 수 있어 매우 위협적입니다. [Recommendations] 이를 방지하기 위해 개발자나 사용자는 안드로이드 기기에서 불필요한 USB 디버깅(ADB) 옵션을 반드시 비활성화해야 합니다. 기업 보안팀은 네트워크 방화벽에서 ADB 표준 포트(5555)에 대한 외부 접근을 엄격히 통제하고, MDM(Mobile Device Management) 솔루션을 사용하여 기기의 무결성을 실시간으로 점검해야 합니다. 또한, 공인되지 않은 앱 스토어의 이용을 지양하고 보안 업데이트를 최신으로 유지하는 것이 필수적입니다.",
  "severity_score": 8.5,
  "severity_level": "CRITICAL",
  "tags": [
    "Android Botnet",
    "ADB Exploitation",
    "Residential Proxy",
    "DDoS",
    "Mobile Malware"
  ],
  "references": [
    "Synthient, Kimwolf Botnet: Analysis of Residential Proxy Monetization, Industry Report, 2024",
    "MITRE ATT&CK: T1059.001 (Command and Scripting Interpreter: PowerShell) via ADB",
    "NIST SP 800-124 Rev. 2, Guidelines for Managing the Security of Mobile Devices in the Enterprise, 2020",
    "CWE-284: Improper Access Control (ADB Exposure)"
  ],
  "is_analyzed": true
}