{
  "id": "c6e6c376-a549-42ee-9e91-d062a4617b6b",
  "title": "Microsoft Operating Systems BlueKeep Vulnerability",
  "url": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa19-168a",
  "content": "<div>\n<h2><strong>Summary</strong></h2>\n</div>\n<p>The Cybersecurity and Infrastructure Security Agency (CISA) is issuing this Activity Alert to provide information on a vulnerability, known as “BlueKeep,” that exists in the following Microsoft Windows Operating Systems (OSs), including both 32- and 64-bit versions, as well as all Service Pack versions:</p>\n<ul>\n<li>Windows 2000</li>\n<li>Windows Vista</li>\n<li>Windows XP</li>\n<li>Windows 7</li>\n<li>Windows Server 2003</li>\n<li>Windows Server 2003 R2</li>\n<li>Windows Server 2008</li>\n<li>Windows Server 2008 R2</li>\n</ul>\n<p>An attacker can exploit this vulnerability to take control of an affected system. &nbsp;&nbsp; &nbsp;</p>\n<div>\n<h2><strong>Technical Details</strong></h2>\n</div>\n<p>BlueKeep (CVE-2019-0708) exists within the Remote Desktop Protocol (RDP) used by the Microsoft Windows OSs listed above. An attacker can exploit this vulnerability to perform remote code execution on an unprotected system.&nbsp;</p>\n<p>According to Microsoft, an attacker can send specially crafted packets to one of these operating systems that has RDP enabled.[<a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2019-0708\" title=\"Remote Desktop Services Remote Code Execution Vulnerability\">1</a>] After successfully sending the packets, the attacker would have the ability to perform a number of actions: adding accounts with full user rights; viewing, changing, or deleting data; or installing programs. This exploit, which requires no user interaction, must occur before authentication to be successful.</p>\n<p>BlueKeep is considered “wormable” because malware exploiting this vulnerability on a system could propagate to other vulnerable systems; thus, a BlueKeep exploit would be capable of rapidly spreading in a fashion similar to the WannaCry malware attacks of 2017.[2]</p>\n<p>CISA has coordinated with external stakeholders and determined that Windows 2000 is vulnerable to BlueKeep.</p>\n<div>\n<h3>Mitigations</h3>\n</div>\n<p>CISA encourages users and administrators review the Microsoft Security Advisory [<a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2019-0708\" title=\"Remote Desktop Services Remote Code Execution Vulnerability\">1</a>] and the Microsoft Customer Guidance for CVE-2019-0708 [<a href=\"https://support.microsoft.com/en-us/topic/customer-guidance-for-cve-2019-0708-remote-desktop-services-remote-code-execution-vulnerability-may-14-2019-0624e35b-5f5d-6da7-632c-27066a79262e\" title=\"Customer guidance for CVE-2019-0708 | Remote Desktop Services Remote Code Execution Vulnerability: May 14, 2019\">3</a>] and apply the appropriate mitigation measures as soon as possible:</p>\n<ul>\n<li><strong>Install available patches.</strong> Microsoft has released security updates to patch this vulnerability. Microsoft has also released patches for a number of OSs that are no longer officially supported, including Windows Vista, Windows XP, and Windows Server 2003. As always, CISA encourages users and administrators to test patches before installation.</li>\n</ul>\n<p>For OSs that do not have patches or systems that cannot be patched, other mitigation steps can be used to help protect against BlueKeep:</p>\n<ul>\n<li><strong>Upgrade end-of-life (EOL) OSs.</strong> Consider upgrading any EOL OSs no longer supported by Microsoft to a newer, supported OS, such as Windows 10.</li>\n<li><strong>Disable unnecessary services.</strong> Disable services not being used by the OS. This best practice limits exposure to vulnerabilities. &nbsp;</li>\n<li><strong>Enable Network Level Authentication.</strong> Enable Network Level Authentication in Windows 7, Windows Server 2008, and Windows Server 2008 R2. Doing so forces a session request to be authenticated and effectively mitigates against BlueKeep, as exploit of the vulnerability requires an unauthenticated session.</li>\n<li><strong>Block Transmission Control Protocol (TCP) port 3389 at the enterprise perimeter firewall.</strong> Because port 3389 is used to initiate an RDP session, blocking it prevents an attacker from exploiting BlueKeep from outside the user’s network. However, this will block legitimate RDP sessions and may not prevent unauthenticated sessions from being initiated inside a network.</li>\n</ul>\n<div>\n<h2><strong>References</strong></h2>\n<p>[1] <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2019-0708\" title=\"Remote Desktop Services Remote Code Execution Vulnerability\">Microsoft Security Advisory for CVE-2019-0708</a><br>[2] White House Press Briefing on the Attribution of the WannaCry Malware Attack to North Korea<br>[3] <a href=\"https://support.microsoft.com/en-us/topic/customer-guidance-for-cve-2019-0708-remote-desktop-services-remote-code-execution-vulnerability-may-14-2019-0624e35b-5f5d-6da7-632c-27066a79262e\" title=\"Customer guidance for CVE-2019-0708 | Remote Desktop Services Remote Code Execution Vulnerability: May 14, 2019\">Microsoft Customer Guidance for CVE-2019-0708</a></p>\n</div>\n<div>\n<h2><strong>Revisions</strong></h2>\n</div>\n<p><strong>June 17, 2019:</strong> Initial version<br><strong>June 17, 2019:</strong> Revised technical details section.</p>\n",
  "source": "CISA US-CERT",
  "timestamp": "2026-01-05T18:26:44.733Z",
  "summary": "Executive Overview: BlueKeep (CVE-2019-0708) is a critical remote code execution (RCE) vulnerability within Microsoft’s Remote Desktop Services (RDS). Discovered in 2019, its significance stems from its 'wormable' nature, meaning an exploit could autonomously spread across a network without any user intervention, mirroring the devastating impact of the 2017 WannaCry and NotPetya ransomware attacks. This vulnerability posed a systemic risk to global infrastructure, particularly for organizations still relying on legacy Windows operating systems. Threat Analysis: The technical root cause of BlueKeep is a use-after-free vulnerability located in the termdd.sys kernel driver. An unauthenticated attacker can trigger this flaw by sending a sequence of specially crafted Remote Desktop Protocol (RDP) packets to the target system over the 'MS_T120' virtual channel. Because the exploitation occurs during the pre-authentication phase, it requires no valid credentials, making it highly accessible for remote exploitation. Attackers can leverage this to execute arbitrary code with kernel-level privileges. Impact Assessment: The vulnerability affects a wide range of legacy platforms, including Windows XP, Windows 7, Windows Server 2003, and Windows Server 2008. Successful exploitation allows an attacker to gain full administrative control of the host, enabling them to install programs, modify data, and create new accounts with full user rights. Given the wormable capability, a single compromised machine could serve as an entry point for an automated infection of an entire enterprise network. Recommendations: Immediate application of Microsoft’s official security patches is the primary defense. For organizations utilizing end-of-life systems, Microsoft has issued extraordinary patches that must be deployed. Supplementary mitigations include enforcing Network Level Authentication (NLA) to require pre-exploit authentication, blocking TCP port 3389 at perimeter firewalls to prevent external access, and disabling RDP services on all non-essential systems to minimize the attack surface.",
  "severity_score": 9.8,
  "severity_level": "CRITICAL",
  "tags": [
    "CVE-2019-0708",
    "BlueKeep",
    "Wormable",
    "RDP",
    "Remote Code Execution"
  ],
  "references": [
    "CVE-2019-0708",
    "MITRE ATT&CK: T1210",
    "CISA, 'Alert (AA19-168A): Microsoft Operating Systems BlueKeep Vulnerability', 2019",
    "Microsoft MSRC, 'Prevent a worm by updating Remote Desktop Services (CVE-2019-0708)', Microsoft, 2019",
    "NIST, 'NVD - CVE-2019-0708 Detail', National Institute of Standards and Technology, 2019"
  ],
  "is_analyzed": true
}