{
  "id": "c7cec33b-e1bb-4726-8510-77a01431effe",
  "title": "Kimwolf Android Botnet Infects Over 2 Million Devices via Exposed ADB and Proxy Networks",
  "url": "https://thehackernews.com/2026/01/kimwolf-android-botnet-infects-over-2.html",
  "content": "The botnet known as Kimwolf has infected more than 2 million Android devices by tunneling through residential proxy networks, according to findings from Synthient.\n\"Key actors involved in the Kimwolf botnet are observed monetizing the botnet through app installs, selling residential proxy bandwidth, and selling its DDoS functionality,\" the company said in an analysis published last week.\nKimwolf",
  "source": "The Hacker News",
  "timestamp": "2026-01-05T18:21:08.911Z",
  "summary": "Executive Overview: The Kimwolf botnet represents a sophisticated and large-scale threat to the Android ecosystem, having compromised over 2 million devices globally. By leveraging exposed Android Debug Bridge (ADB) interfaces and integrating infected hardware into residential proxy networks, the botnet operators have established a resilient infrastructure for diverse cybercriminal activities. This threat highlights the ongoing danger of legacy misconfigurations in mobile and IoT devices, which are increasingly being weaponized for high-volume illicit operations.\n\nThreat Analysis: Kimwolf's primary infection vector focuses on scanning for and exploiting exposed ADB ports (typically TCP/5555), allowing for remote command execution without user intervention. Once the initial foothold is established, the botnet deploys specialized binaries that convert the device into a residential proxy node. This enables the threat actors to tunnel traffic through legitimate consumer IP addresses, effectively bypassing many IP-based reputation systems and bot detection filters. The botnet further monetizes its footprint through automated app installations and the execution of high-volume Distributed Denial-of-Service (DDoS) attacks directed via a centralized command-and-control (C2) server.\n\nImpact Assessment: The consequences of a Kimwolf infection are multi-layered. For individual users, the botnet causes significant battery drain, performance degradation, and data overages as the device's bandwidth is surreptitiously sold. At a broader level, the sheer volume of 2 million infected nodes provides a massive platform for credential stuffing, ad fraud, and disruptive DDoS campaigns. The use of residential proxies makes it exceptionally difficult for defenders to distinguish between legitimate user traffic and malicious botnet activity, complicating mitigation efforts for target organizations.\n\nRecommendations: To mitigate the risk of Kimwolf and similar Android-based threats, users and organizations must ensure that ADB is disabled by default on all production devices. Enterprise environments should utilize Mobile Device Management (MDM) solutions to enforce strict configuration policies and monitor for unauthorized network activity on port 5555. Additionally, network administrators should implement egress filtering to block known C2 communication patterns and employ anomaly detection to identify unusual outbound bandwidth spikes that may indicate a device has been co-opted into a proxy network.",
  "severity_score": 8.5,
  "severity_level": "HIGH",
  "tags": [
    "Android Botnet",
    "ADB Exploitation",
    "Residential Proxy",
    "DDoS",
    "Mobile Security"
  ],
  "references": [
    "Li et al., Measuring and Analyzing the Residential Proxy Market, IEEE Symposium on Security and Privacy (S&P), 2019",
    "MITRE ATT&CK: T1090.002",
    "NIST Special Publication 800-124 Revision 2, Guidelines for Managing the Security of Mobile Devices in the Enterprise, 2023",
    "MITRE ATT&CK: T1476"
  ],
  "is_analyzed": true
}