[
  {
    "id": "5405e92f-62c4-4fc3-99d5-0c576dd37944",
    "title": "Russia-Aligned Hackers Abuse Viber to Target Ukrainian Military and Government",
    "url": "https://thehackernews.com/2026/01/russia-aligned-hackers-abuse-viber-to.html",
    "content": "The Russia-aligned threat actor known as UAC-0184 has been observed targeting Ukrainian military and government entities by leveraging the Viber messaging platform to deliver malicious ZIP archives.\n\"This organization has continued to conduct high-intensity intelligence gathering activities against Ukrainian military and government departments in 2025,\" the 360 Threat Intelligence Center said in",
    "source": "The Hacker News",
    "timestamp": "2026-01-05T18:26:44.634Z"
  },
  {
    "id": "ba92630b-fa46-4276-80c4-517aea51f0bf",
    "title": "Kimwolf Android Botnet Infects Over 2 Million Devices via Exposed ADB and Proxy Networks",
    "url": "https://thehackernews.com/2026/01/kimwolf-android-botnet-infects-over-2.html",
    "content": "The botnet known as Kimwolf has infected more than 2 million Android devices by tunneling through residential proxy networks, according to findings from Synthient.\n\"Key actors involved in the Kimwolf botnet are observed monetizing the botnet through app installs, selling residential proxy bandwidth, and selling its DDoS functionality,\" the company said in an analysis published last week.\nKimwolf",
    "source": "The Hacker News",
    "timestamp": "2026-01-05T18:26:44.634Z"
  },
  {
    "id": "05b668b9-0f04-44a7-8142-349c42c8c00a",
    "title": "⚡ Weekly Recap: IoT Exploits, Wallet Breaches, Rogue Extensions, AI Abuse & More",
    "url": "https://thehackernews.com/2026/01/weekly-recap-iot-exploits-wallet.html",
    "content": "The year opened without a reset. The same pressure carried over, and in some places it tightened. Systems people assume are boring or stable are showing up in the wrong places. Attacks moved quietly, reused familiar paths, and kept working longer than anyone wants to admit.\nThis week’s stories share one pattern. Nothing flashy. No single moment. Just steady abuse of trust — updates, extensions,",
    "source": "The Hacker News",
    "timestamp": "2026-01-05T18:26:44.634Z"
  },
  {
    "id": "c6cffb71-c6a4-4111-87ca-18a81e50980c",
    "title": "The State of Cybersecurity in 2025: Key Segments, Insights, and Innovations ",
    "url": "https://thehackernews.com/2026/01/the-state-of-cybersecurity-in-2025key.html",
    "content": "Featuring:\n\nCybersecurity is being reshaped by forces that extend beyond individual threats or tools. As organizations operate across cloud infrastructure, distributed endpoints, and complex supply chains, security has shifted from a collection of point solutions to a question of architecture, trust, and execution speed.\nThis report examines how core areas of cybersecurity are evolving in",
    "source": "The Hacker News",
    "timestamp": "2026-01-05T18:26:44.634Z"
  },
  {
    "id": "f0313bf9-70a4-4ca0-820c-2136933adbe4",
    "title": "Bitfinex Hack Convict Ilya Lichtenstein Released Early Under U.S. First Step Act",
    "url": "https://thehackernews.com/2026/01/bitfinex-hack-convict-ilya-lichtenstein.html",
    "content": "Ilya Lichtenstein, who was sentenced to prison last year for money laundering charges in connection with his role in the massive hack of cryptocurrency exchange Bitfinex in 2016, said he has been released early.\nIn a post shared on X last week, the 38-year-old announced his release, crediting U.S. President Donald Trump's First Step Act. According to the Federal Bureau of Prisons' inmate locator",
    "source": "The Hacker News",
    "timestamp": "2026-01-05T18:26:44.634Z"
  },
  {
    "id": "aaafd68e-294d-48c6-9b92-b08f1e2cbaba",
    "title": "Publicly Available Tools Seen in Cyber Incidents Worldwide",
    "url": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa18-284a",
    "content": "<div>\n<h2><strong>Summary</strong></h2>\n</div>\n<p>This report is a collaborative research effort by the cyber security authorities of five nations: Australia, Canada, New Zealand, the United Kingdom, and the United States.[1][2][3][4][5]</p>\n<p>In it we highlight the use of five publicly available tools, which have been used for malicious purposes in recent cyber incidents around the world. The five tools are:</p>\n<ol>\n<li>Remote Access Trojan: JBiFrost</li>\n<li>Webshell: China Chopper</li>\n<li>Credential Stealer: Mimikatz</li>\n<li>Lateral Movement Framework: PowerShell Empire</li>\n<li>C2 Obfuscation and Exfiltration: HUC Packet Transmitter</li>\n</ol>\n<p>To aid the work of network defenders and systems administrators, we also provide advice on limiting the effectiveness of these tools and detecting their use on a network.</p>\n<p>The individual tools we cover in this report are limited examples of the types of tools used by threat actors. You should not consider this an exhaustive list when planning your network defense.</p>\n<p>Tools and techniques for exploiting networks and the data they hold are by no means the preserve of nation states or criminals on the dark web. Today, malicious tools with a variety of functions are widely and freely available for use by everyone from skilled penetration testers, hostile state actors and organized criminals, to amateur cyber criminals.</p>\n<p>The tools in this Activity Alert have been used to compromise information across a wide range of critical sectors, including health, finance, government, and defense. Their widespread availability presents a challenge for network defense and threat-actor attribution.</p>\n<p>Experience from all our countries makes it clear that, while cyber threat actors continue to develop their capabilities, they still make use of established tools and techniques. Even the most sophisticated threat actor groups use common, publicly available tools to achieve their objectives.</p>\n<p>Whatever these objectives may be, initial compromises of victim systems are often established through exploitation of common security weaknesses. Abuse of unpatched software vulnerabilities or poorly configured systems are common ways for a threat actor to gain access. The tools detailed in this Activity Alert come into play once a compromise has been achieved, enabling attackers to further their objectives within the victim’s systems.</p>\n<h3>How to Use This Report</h3>\n<p>The tools detailed in this Activity Alert fall into five categories: Remote Access Trojans (RATs), webshells, credential stealers, lateral movement frameworks, and command and control (C2) obfuscators.</p>\n<p>This Activity Alert provides an overview of the threat posed by each tool, along with insight into where and when it has been deployed by threat actors. Measures to aid detection and limit the effectiveness of each tool are also described.</p>\n<p>The Activity Alert concludes with general advice for improving network defense practices.</p>\n<div>\n<h2><strong>Technical Details</strong></h2>\n</div>\n<h3>Remote Access Trojan: JBiFrost</h3>\n<p>First observed in May 2015, the JBiFrost RAT is a variant of the Adwind RAT, with roots stretching back to the Frutas RAT from 2012.</p>\n<p>A RAT is a program that, once installed on a victim’s machine, allows remote administrative control. In a malicious context, it can—among many other functions—be used to install backdoors and key loggers, take screen shots, and exfiltrate data.</p>\n<p>Malicious RATs can be difficult to detect because they are normally designed not to appear in lists of running programs and can mimic the behavior of legitimate applications.</p>\n<p>To prevent forensic analysis, RATs have been known to disable security measures (e.g., Task Manager) and network analysis tools (e.g., Wireshark) on the victim’s system.</p>\n<h4><strong>In Use</strong></h4>\n<p>JBiFrost RAT&nbsp;is typically employed by cyber criminals and low-skilled threat actors, but its capabilities could easily be adapted for use by state-sponsored threat actors.</p>\n<p>Other RATs are widely used by Advanced Persistent Threat (APT) actor groups, such as Adwind RAT, against the aerospace and defense sector; or Quasar RAT, by APT10, against a broad range of sectors.</p>\n<p>Threat actors have repeatedly compromised servers in our countries with the purpose of delivering malicious RATs to victims, either to gain remote access for further exploitation, or to steal valuable information such as banking credentials, intellectual property, or PII.</p>\n<h4><strong>Capabilities</strong></h4>\n<p>JBiFrost RAT is Java-based, cross-platform, and multifunctional. It poses a threat to several different operating systems, including Windows, Linux, MAC OS X, and Android.</p>\n<p>JBiFrost RAT allows threat actors to pivot and move laterally across a network or install additional malicious software. It is primarily delivered through emails as an attachment, usually an invoice notice, request for quotation, remittance notice, shipment notification, payment notice, or with a link to a file hosting service.</p>\n<p>Past infections have exfiltrated intellectual property, banking credentials, and personally identifiable information (PII). Machines infected with JBiFrost RAT can also be used in botnets to carry out distributed denial-of-service attacks.</p>\n<h4><strong>Examples</strong></h4>\n<p>Since early 2018, we have observed an increase in JBiFrost RAT being used in targeted attacks against critical national infrastructure owners and their supply chain operators. There has also been an increase in the RAT’s hosting on infrastructure located in our countries.</p>\n<p>In early 2017, Adwind RAT was deployed via spoofed emails designed to look as if they originated from Society for Worldwide Interbank Financial Telecommunication, or SWIFT, network services.</p>\n<p>Many other publicly available RATs, including variations of Gh0st RAT, have also been observed in use against a range of victims worldwide.</p>\n<h4><strong>Detection and Protection</strong></h4>\n<p>Some possible indications of a JBiFrost RAT infection can include, but are not limited to:</p>\n<ul>\n<li>Inability to restart the computer in safe mode,</li>\n<li>Inability to open the Windows Registry Editor or Task Manager,</li>\n<li>Significant increase in disk activity and/or network traffic,</li>\n<li>Connection attempts to known malicious Internet Protocol (IP) addresses, and</li>\n<li>Creation of new files and directories with obfuscated or random names.</li>\n</ul>\n<p>Protection is best afforded by ensuring systems and installed applications are all fully patched and updated. The use of a modern antivirus program with automatic definition updates and regular system scans will also help ensure that most of the latest variants are stopped in their tracks. You should ensure that your organization is able to collect antivirus detections centrally across its estate and investigate RAT detections efficiently.</p>\n<p>Strict application allow listing is recommended to prevent infections from occurring.</p>\n<p>The initial infection mechanism for RATs, including JBiFrost RAT, can be via phishing emails. You can help prevent JBiFrost RAT infections by stopping these phishing emails from reaching your users, helping users to identify and report phishing emails, and implementing security controls so that the malicious email does not compromise your device. The United Kingdom National Cyber Security Centre (UK NCSC) has published <a href=\"https://www.ncsc.gov.uk/guidance/phishing\" title=\"Phishing attacks: defending your organisation\">phishing guidance</a>.</p>\n<h3>Webshell: China Chopper</h3>\n<p>China Chopper is a publicly available, well-documented webshell that has been in widespread use since 2012.</p>\n<p>Webshells are malicious scripts that are uploaded to a target host after an initial compromise and grant a threat actor remote administrative capability.</p>\n<p>Once this access is established, webshells can also be used to pivot to additional hosts within a network.</p>\n<h4><strong>In Use</strong></h4>\n<p>China Chopper is extensively used by threat actors to remotely access compromised web servers, where it provides file and directory management, along with access to a virtual terminal on the compromised device.</p>\n<p>As China Chopper is just 4 KB in size and has an easily modifiable payload, detection and mitigation are difficult for network defenders.</p>\n<h4><strong>Capabilities</strong></h4>\n<p>China Chopper has two main components: the China Chopper client-side, which is run by the attacker, and the China Chopper server, which is installed on the victim web server but is also attacker-controlled.</p>\n<p>The webshell client can issue terminal commands and manage files on the victim server. Its MD5 hash is publicly available (originally posted on hxxp://www.maicaidao.com).</p>\n<p>The MD5 hash of the web client is shown in table 1 below.</p>\n<table class=\"tablesaw tablesaw-stack\" data-tablesaw-mode=\"stack\" data-tablesaw-minimap=\"\">\n<caption>Table 1: China Chopper webshell client MD5 hash</caption>\n<thead>\n<tr>\n<th scope=\"col\" role=\"columnheader\" data-tablesaw-priority=\"persist\"><strong>Webshell Client</strong></th>\n<th scope=\"col\" role=\"columnheader\"><strong>MD5 Hash</strong></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>caidao.exe</td>\n<td>5001ef50c7e869253a7c152a638eab8a</td>\n</tr>\n</tbody>\n</table>\n<p>The webshell server is uploaded in plain text and can easily be changed by the attacker. This makes it harder to define a specific hash that can identify adversary activity. In summer 2018, threat actors were observed targeting public-facing web servers that were vulnerable to CVE-2017-3066. The activity was related to a vulnerability in the web application development platform Adobe ColdFusion, which enabled remote code execution.</p>\n<p>China Chopper was intended as the second-stage payload, delivered once servers had been compromised, allowing the threat actor remote access to the victim host. After successful exploitation of a vulnerability on the victim machine, the text-based China Chopper is placed on the victim web server. Once uploaded, the webshell server can be accessed by the threat actor at any time using the client application. Once successfully connected, the threat actor proceeds to manipulate files and data on the web server.</p>\n<p>China Chopper’s capabilities include uploading and downloading files to and from the victim using the file-retrieval tool <code>wget</code> to download files from the internet to the target; and editing, deleting, copying, renaming, and even changing the timestamp, of existing files.</p>\n<h4><strong>Detection and protection</strong></h4>\n<p>The most powerful defense against a webshell is to avoid the web server being compromised in the first place. Ensure that all the software running on public-facing web servers is up-to-date with security patches applied. Audit custom applications for common web vulnerabilities. [<a href=\"https://owasp.org/www-project-top-ten/\" title=\"OWASP Top Ten\">6</a>]</p>\n<p>One attribute of China Chopper is that every action generates a hypertext transfer protocol (HTTP) POST. This can be noisy and is easily spotted if investigated by a network defender.</p>\n<p>While the China Chopper webshell server upload is plain text, commands issued by the client are Base64 encoded, although this is easily decodable.</p>\n<p>The adoption of Transport Layer Security (TLS) by web servers has resulted in web server traffic becoming encrypted, making detection of China Chopper activity using network-based tools more challenging.</p>\n<p>The most effective way to detect and mitigate China Chopper is on the host itself—specifically on public-facing web servers. There are simple ways to search for the presence of the web-shell using the command line on both Linux and Windows based operating systems. [<a href=\"https://cloud.google.com/blog/topics/threat-intelligence/breaking-down-the-china-chopper-web-shell-part-ii/\" title=\"Breaking Down the China Chopper Web Shell - Part II\">7</a>]</p>\n<p>To detect webshells more broadly, network defenders should focus on spotting either suspicious process execution on web servers (e.g., Hypertext Preprocessor [PHP] binaries spawning processes) and out-of-pattern outbound network connections from web servers. Typically, web servers make predictable connections to an internal network. Changes in those patterns may indicate the presence of a web shell. You can manage network permissions to prevent web-server processes from writing to directories where PHP can be executed, or from modifying existing files.</p>\n<p>We also recommend that you use web access logs as a source of monitoring, such as through traffic analytics. Unexpected pages or changes in traffic patterns can be early indicators.</p>\n<h3>Credential Stealer: Mimikatz</h3>\n<p>Developed in 2007, Mimikatz is mainly used by attackers to collect the credentials of other users, who are logged into a targeted Windows machine. It does this by accessing the credentials in memory within a Windows process called Local Security Authority Subsystem Service (LSASS).</p>\n<p>These credentials, either in plain text, or in hashed form, can be reused to give access to other machines on a network.</p>\n<p>Although it was not originally intended as a hacking tool, in recent years Mimikatz has been used by multiple actors for malicious purposes. Its use in compromises around the world has prompted organizations globally to re-evaluate their network defenses.</p>\n<p>Mimikatz is typically used by threat actors once access has been gained to a host and the threat actor wishes to move throughout the internal network. Its use can significantly undermine poorly configured network security.</p>\n<h4><strong>In Use</strong></h4>\n<p>Mimikatz source code is publicly available, which means anyone can compile their own versions of the new tool and potentially develop new Mimikatz custom plug-ins and additional functionality.</p>\n<p>Our cyber authorities have observed widespread use of Mimikatz among threat actors, including organized crime and state-sponsored groups.</p>\n<p>Once a threat actor has gained local administrator privileges on a host, Mimikatz provides the ability to obtain the hashes and clear-text credentials of other users, enabling the threat actor to escalate privileges within a domain and perform many other post-exploitation and lateral movement tasks.</p>\n<p>For this reason, Mimikatz has been bundled into other penetration testing and exploitation suites, such as PowerShell Empire and Metasploit.</p>\n<h4><strong>Capabilities</strong></h4>\n<p>Mimikatz is best known for its ability to retrieve clear text credentials and hashes from memory, but its full suite of capabilities is extensive.</p>\n<p>The tool can obtain Local Area Network Manager and NT LAN Manager hashes, certificates, and long-term keys on Windows XP (2003) through Windows 8.1 (2012r2). In addition, it can perform pass-the-hash or pass-the-ticket tasks and build Kerberos “golden tickets.”</p>\n<p>Many features of Mimikatz can be automated with scripts, such as PowerShell, allowing a threat actor to rapidly exploit and traverse a compromised network. Furthermore, when operating in memory through the freely available “Invoke-Mimikatz” PowerShell script, Mimikatz activity is very difficult to isolate and identify.</p>\n<h4><strong>Examples</strong></h4>\n<p>Mimikatz has been used across multiple incidents by a broad range of threat actors for several years. In 2011, it was used by unknown threat actors to obtain administrator credentials from the Dutch certificate authority, DigiNotar. The rapid loss of trust in DigiNotar led to the company filing for bankruptcy within a month of this compromise.</p>\n<p>More recently, Mimikatz was used in conjunction with other malicious tools—in the NotPetya and BadRabbit ransomware attacks in 2017 to extract administrator credentials held on thousands of computers. These credentials were used to facilitate lateral movement and enabled the ransomware to propagate throughout networks, encrypting the hard drives of numerous systems where these credentials were valid.</p>\n<p>In addition, a Microsoft research team identified use of Mimikatz during a sophisticated cyberattack targeting several high-profile technology and financial organizations. In combination with several other tools and exploited vulnerabilities, Mimikatz was used to dump and likely reuse system hashes.</p>\n<h4><strong>Detection and Protection</strong></h4>\n<p>Updating Windows will help reduce the information available to a threat actor from the Mimikatz tool, as Microsoft seeks to improve the protection offered in each new Windows version.</p>\n<p>To prevent Mimikatz credential retrieval, network defenders should disable the storage of clear text passwords in LSASS memory. This is default behavior for Windows 8.1/Server 2012 R2 and later, but can be specified on older systems which have the relevant security patches installed.[<a href=\"https://support.microsoft.com/en-us/topic/microsoft-security-advisory-update-to-improve-credentials-protection-and-management-may-13-2014-93434251-04ac-b7f3-52aa-9f951c14b649\" title=\"Microsoft Security Advisory: Update to improve credentials protection and management: May 13, 2014\">8</a>] Windows 10 and Windows Server 2016 systems can be protected by using newer security features, such as Credential Guard.</p>\n<p>Credential Guard will be enabled by default if:</p>\n<ul>\n<li>The hardware meets Microsoft’s Windows Hardware Compatibility Program Specifications and Policies for Windows Server 2016 and Windows Server Semi-Annual Branch; and</li>\n<li>The server is not acting as a Domain Controller.</li>\n</ul>\n<p>You should verify that your physical and virtualized servers meet Microsoft’s <a href=\"https://learn.microsoft.com/en-us/windows/security/identity-protection/credential-guard/\" title=\"Credential Guard overview\">minimum requirements for each release of Windows 10 and Windows Server</a>.</p>\n<p>Password reuse across accounts, particularly administrator accounts, makes pass-the-hash attacks far simpler. You should set user policies within your organization that discourage password reuse, even across common level accounts on a network. The freely available Local Administrator Password Solution from Microsoft can allow easy management of local administrator passwords, preventing the need to set and store passwords manually.</p>\n<p>Network administrators should monitor and respond to unusual or unauthorized account creation or authentication to prevent Kerberos ticket exploitation, or network persistence and lateral movement. For Windows, tools such as Microsoft Advanced Threat Analytics and Azure Advanced Threat Protection can help with this.</p>\n<p>Network administrators should ensure that systems are patched and up-to-date. Numerous Mimikatz features are mitigated or significantly restricted by the latest system versions and updates. But no update is a perfect fix, as Mimikatz is continually evolving and new third-party modules are often developed.</p>\n<p>Most up-to-date antivirus tools will detect and isolate non-customized Mimikatz use and should therefore be used to detect these instances. But threat actors can sometimes circumvent antivirus systems by running Mimikatz in memory, or by slightly modifying the original code of the tool. Wherever Mimikatz is detected, you should perform a rigorous investigation, as it almost certainly indicates a threat actor is actively present in the network, rather than an automated process at work.</p>\n<p>Several of Mimikatz’s features rely on exploitation of administrator accounts. Therefore, you should ensure that administrator accounts are issued on an as-required basis only. Where administrative access is required, you should apply privileged access management principles.</p>\n<p>Since Mimikatz can only capture the accounts of those users logged into a compromised machine, privileged users (e.g., domain administrators) should avoid logging into machines with their privileged credentials. Detailed information on securing Active Directory is available from Microsoft.[<a href=\"https://learn.microsoft.com/en-us/windows-server/identity/ad-ds/plan/security-best-practices/best-practices-for-securing-active-directory\" title=\"Best Practices for Securing Active Directory\">9</a>]</p>\n<p>Network defenders should audit the use of scripts, particularly PowerShell, and inspect logs to identify anomalies. This will aid in identifying Mimikatz or pass-the-hash abuse, as well as in providing some mitigation against attempts to bypass detection software.</p>\n<h3>Lateral Movement Framework: PowerShell Empire</h3>\n<p>PowerShell Empire is an example of a post-exploitation or lateral movement tool. It is designed to allow an attacker (or penetration tester) to move around a network after gaining initial access. Other examples of these tools include Cobalt Strike and Metasploit. PowerShell Empire can also be used to generate malicious documents and executables for social engineering access to networks.</p>\n<p>The PowerShell Empire framework was designed as a legitimate penetration testing tool in 2015. PowerShell Empire acts as a framework for continued exploitation once a threat actor has gained access to a system.</p>\n<p>The tool provides a threat actor with the ability to escalate privileges, harvest credentials, exfiltrate information, and move laterally across a network. These capabilities make it a powerful exploitation tool. Because it is built on a common legitimate application (PowerShell) and can operate almost entirely in memory, PowerShell Empire can be difficult to detect on a network using traditional antivirus tools.</p>\n<h4><strong>In Use</strong></h4>\n<p>PowerShell Empire has become increasingly popular among hostile state actors and organized criminals. In recent years we have seen it used in cyber incidents globally across a wide range of sectors.</p>\n<p>Initial exploitation methods vary between compromises, and threat actors can configure the PowerShell Empire uniquely for each scenario and target. This, in combination with the wide range of skill and intent within the PowerShell Empire user community, means that the ease of detection will vary. Nonetheless, having a greater understanding and awareness of this tool is a step forward in defending against its use by threat actors.</p>\n<h4><strong>Capabilities</strong></h4>\n<p>PowerShell Empire enables a threat actor to carry out a range of actions on a victim’s machine and implements the ability to run PowerShell scripts without needing powershell.exe to be present on the system Its communications are encrypted and its architecture is flexible.</p>\n<p>PowerShell Empire uses \"modules\" to perform more specific malicious actions. These modules provide the threat actor with a customizable range of options to pursue their goals on the victim’s systems. These goals include escalation of privileges, credential harvesting, host enumeration, keylogging, and the ability to move laterally across a network.</p>\n<p>PowerShell Empire’s ease of use, flexible configuration, and ability to evade detection make it a popular choice for threat actors of varying abilities.</p>\n<h4><strong>Examples</strong></h4>\n<p>During an incident in February 2018, a UK energy sector company was compromised by an unknown threat actor. This compromise was detected through PowerShell Empire beaconing activity using the tool’s default profile settings. Weak credentials on one of the victim’s administrator accounts are believed to have provided the threat actor with initial access to the network.</p>\n<p>In early 2018, an unknown threat actor used Winter Olympics-themed socially engineered emails and malicious attachments in a spear-phishing campaign targeting several South Korean organizations. This attack had an additional layer of sophistication, making use of <code>Invoke-PSImage</code>, a stenographic tool that will encode any PowerShell script into an image.</p>\n<p>In December 2017, APT19 targeted a multinational law firm with a phishing campaign. APT19 used obfuscated PowerShell macros embedded within Microsoft Word documents generated by PowerShell Empire.</p>\n<p>Our cybersecurity authorities are also aware of PowerShell Empire being used to target academia. In one reported instance, a threat actor attempted to use PowerShell Empire to gain persistence using a Windows Management Instrumentation event consumer. However, in this instance, the PowerShell Empire agent was unsuccessful in establishing network connections due to the HTTP connections being blocked by a local security appliance.</p>\n<h4><strong>Detection and Protection</strong></h4>\n<p>Identifying malicious PowerShell activity can be difficult due to the prevalence of legitimate PowerShell activity on hosts and the increased use of PowerShell in maintaining a corporate environment.</p>\n<p>To identify potentially malicious scripts, PowerShell activity should be comprehensively logged. This should include script block logging and PowerShell transcripts.</p>\n<p>Older versions of PowerShell should be removed from environments to ensure that they cannot be used to circumvent additional logging and controls added in more recent versions of PowerShell. This page provides a good summary of PowerShell security practices.[<a href=\"https://reliaquest.com/blog/powershell-security-best-practices/\" title=\"PowerShell Security Best Practices\">10</a>]</p>\n<p>The code integrity features in recent versions of Windows can be used to limit the functionality of PowerShell, preventing or hampering malicious PowerShell in the event of a successful intrusion.</p>\n<p>A combination of script code signing, application allow listing, and constrained language mode will prevent or limit the effect of malicious PowerShell in the event of a successful intrusion. These controls will also impact legitimate PowerShell scripts and it is strongly advised that they be thoroughly tested before deployment.</p>\n<p>When organizations profile their PowerShell usage, they often find it is only used legitimately by a small number of technical staff. Establishing the extent of this legitimate activity will make it easier to monitor and investigate suspicious or unexpected PowerShell usage elsewhere on the network.</p>\n<h3>C2 Obfuscation and Exfiltration: HUC Packet Transmitter&nbsp;</h3>\n<p>Attackers will often want to disguise their location when compromising a target. To do this, they may use generic privacy tools (e.g., Tor) or more specific tools to obfuscate their location.</p>\n<p>HUC Packet Transmitter (HTran) is a proxy tool used to intercept and redirect Transmission Control Protocol (TCP) connections from the local host to a remote host. This makes it possible to obfuscate an attacker’s communications with victim networks. The tool has been freely available on the internet since at least 2009.</p>\n<p>HTran facilitates TCP connections between the victim and a hop point controlled by a threat actor. Malicious threat actors can use this technique to redirect their packets through multiple compromised hosts running HTran to gain greater access to hosts in a network.</p>\n<h4><strong>In Use</strong></h4>\n<p>The use of HTran has been regularly observed in compromises of both government and industry targets.</p>\n<p>A broad range of threat actors have been observed using HTran and other connection proxy tools to</p>\n<ul>\n<li>Evade intrusion and detection systems on a network,</li>\n<li>Blend in with common traffic or leverage domain trust relationships to bypass security controls,</li>\n<li>Obfuscate or hide C2 infrastructure or communications, and</li>\n<li>Create peer-to-peer or meshed C2 infrastructure to evade detection and provide resilient connections to infrastructure.</li>\n</ul>\n<h4><strong>Capabilities</strong></h4>\n<p>HTran can run in several modes, each of which forwards traffic across a network by bridging two TCP sockets. They differ in terms of where the TCP sockets are initiated from, either locally or remotely. The three modes are</p>\n<ul>\n<li><strong>Server (listen)</strong> – Both TCP sockets initiated remotely;</li>\n<li><strong>Client (slave) </strong>– Both TCP sockets initiated locally; and</li>\n<li><strong>Proxy (tran)</strong> – One TCP socket initiated remotely, the other initiated locally, upon receipt of traffic from the first connection.</li>\n</ul>\n<p>HTran can inject itself into running processes and install a rootkit to hide network connections from the host operating system. Using these features also creates Windows registry entries to ensure that HTran maintains persistent access to the victim network.</p>\n<h4><strong>Examples</strong></h4>\n<p>Recent investigations by our cybersecurity authorities have identified the use of HTran to maintain and obfuscate remote access to targeted environments.</p>\n<p>In one incident, the threat actor compromised externally-facing web servers running outdated and vulnerable web applications. This access enabled the upload of webshells, which were then used to deploy other tools, including HTran.</p>\n<p>HTran was installed into the ProgramData directory and other deployed tools were used to reconfigure the server to accept Remote Desktop Protocol (RDP) communications.</p>\n<p>The threat actor issued a command to start HTran as a client, initiating a connection to a server located on the internet over port 80, which forwards RDP traffic from the local interface.</p>\n<p>In this case, HTTP was chosen to blend in with other traffic that was expected to be seen originating from a web server to the internet. Other well-known ports used included:</p>\n<ul>\n<li>Port 53 – Domain Name System</li>\n<li>Port 443 - HTTP over TLS/Secure Sockets Layer</li>\n<li>Port 3306 - MySQL</li>\n<li>By using HTran in this way, the threat actor was able to use RDP for several months without being detected.</li>\n</ul>\n<h4><strong>Detection and Protection</strong></h4>\n<p>Attackers need access to a machine to install and run HTran, so network defenders should apply security patches and use good access control to prevent attackers from installing malicious applications.</p>\n<p><a href=\"https://www.ncsc.gov.uk/guidance/introduction-logging-security-purposes\" title=\"Introduction to logging for security purposes\">Network monitoring</a> and firewalls can help prevent and detect unauthorized connections from tools such as HTran.</p>\n<p>In some of the samples analyzed, the rootkit component of HTran only hides connection details when the proxy mode is used. When client mode is used, defenders can view details about the TCP connections being made.</p>\n<p>HTran also includes a debugging condition that is useful for network defenders. In the event that a destination becomes unavailable, HTran generates an error message using the following format:</p>\n<div><code>sprint(buffer, “[SERVER]connection to %s:%d error\\r\\n”, host, port2);</code></div>\n<p>This error message is relayed to the connecting client in the clear. Network defenders can monitor for this error message to potentially detect HTran instances active in their environments.</p>\n<div>\n<h2><strong>Mitigations</strong></h2>\n</div>\n<p>There are several measures that will improve the overall cybersecurity of your organization and help protect it against the types of tools highlighted in this report. Network defenders are advised to seek further information using the links below.</p>\n<ul>\n<li>Protect your organization from malware.<br>See NCCIC Guidance: https://www.us-cert.gov/ncas/tips/ST13-003.<br>See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/collection/small-business-guide/protecting-your-organisation-malware\" title=\"Small Business Guide: Cyber Security\">Small Business Guide: Cyber Security</a>.</li>\n<li>Board toolkit: five question for your board’s agenda.<br>See UK NCSC Guidance: https://www.ncsc.gov.uk/guidance/board-toolkit-five-questions-your-boards-agenda.</li>\n<li>Use a strong password policy and multifactor authentication (also known as two-factor authentication or two-step authentication) to reduce the impact of password compromises.<br>See NCCIC Guidance: <a href=\"https://www.cisa.gov/MFA\">More than a Password</a>.<br>See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/collection/mfa-for-your-corporate-online-services\" title=\"Multi-factor authentication for your corporate online services\">Multi-factor authentication for your corporate online services</a> and <a href=\"https://www.ncsc.gov.uk/guidance/setting-2-step-verification-2sv\" title=\"Setting up 2-Step Verification (2SV)\">Setting up 2-Step Verification (2SV)</a>.</li>\n<li>Protect your devices and networks by keeping them up to date. Use the latest supported versions, apply security patches promptly, use antivirus and scan regularly to guard against known malware threats.<br>See NCCIC Guidance: <a href=\"https://www.cisa.gov/news-events/news/understanding-patches-and-software-updates\" title=\"Understanding Patches and Software Updates\">Understanding Patches and Software Updates</a>.<br>See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/guidance/mitigating-malware-and-ransomware-attacks\" title=\"Mitigating malware and ransomware attacks\">Mitigating malware and ransomware attacks</a>.</li>\n<li>Prevent and detect lateral movement in your organization’s networks.<br>See UK NCSC Guidance: <a href=\"https://www.cisa.gov//www.ncsc.gov.uk/guidance/preventing-lateral-movement\" title=\"Preventing Lateral Movement\">Preventing Lateral Movement</a>.</li>\n<li>Implement architectural controls for network segregation.<br>See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/collection/10-steps/architecture-and-configuration\" title=\"Architecture and configuration\">Architecture and configuration</a>.</li>\n<li>Protect the management interfaces of your critical operational systems. In particular, use browse-down architecture to prevent attackers easily gaining privileged access to your most vital assets.<br>See UK NCSC blog post: <a href=\"https://www.ncsc.gov.uk/blog-post/protect-your-management-interfaces\" title=\"Protect your management interfaces\">Protect your management interfaces</a>.</li>\n<li>Set up a security monitoring capability so you are collecting the data that will be needed to analyze network intrusions.<br>See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/guidance/introduction-logging-security-purposes\" title=\"Introduction to logging for security purposes\">Introduction to logging for security purposes</a>.</li>\n<li>Review and refresh your incident management processes.<br>See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/collection/10-steps/incident-management\" title=\"Incident management\">Incident management</a>.</li>\n<li>Update your systems and software. Ensure your operating system and productivity applications are up to date. Users with Microsoft Office 365 licensing can use “click to run” to keep their office applications seamlessly updated.</li>\n<li>Use modern systems and software. These have better security built-in. If you cannot move off out-of-date platforms and applications straight away, there are short-term steps you can take to improve your position.<br>See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/collection/device-security-guidance/managing-deployed-devices/obsolete-products\" title=\"Obsolete products\">Obsolete products</a>.</li>\n<li>Manage bulk personal datasets properly.<br>See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/collection/protecting-bulk-personal-data\" title=\"Protecting bulk personal data\">Protecting bulk personal data</a>.</li>\n<li>Restrict intruders' ability to move freely around your systems and networks. Pay particular attention to potentially vulnerable entry points (e.g., third-party systems with onward access to your core network). During an incident, disable remote access from third-party systems until you are sure they are clean.<br>See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/guidance/preventing-lateral-movement\" title=\"Preventing Lateral Movement\">Preventing Lateral Movement</a> and <a href=\"https://www.ncsc.gov.uk/collection/supply-chain-security/assessing-supply-chain-security\" title=\"Supply chain security guidance\">Assessing supply chain security</a>.</li>\n<li>Allow list applications. If supported by your operating environment, consider allow listing of permitted applications. This will help prevent malicious applications from running.<br>See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/collection/device-security-guidance/platform-guides/windows#applicationwhitelistingsection\" title=\"Windows - Device security guidance\">Device security guidance - Windows</a>.</li>\n<li>Manage macros carefully. Disable Microsoft Office macros, except in the specific applications where they are required.<br>Only enable macros for users that need them day-to-day and use a recent and fully patched version of Office and the underlying platform, ideally configured in line with the UK NCSC’s End User Device Security Collection Guidance and UK NCSC’s Macro Security for Microsoft Office Guidance: <a href=\"https://www.ncsc.gov.uk/collection/device-security-guidance\" title=\"Device security guidance\">Device security guidance</a> and <a href=\"https://www.ncsc.gov.uk/guidance/macro-security-for-microsoft-office\" title=\"Macro Security for Microsoft Office\">Macro Security for Microsoft Office</a>.</li>\n<li>Use antivirus. Keep any antivirus software up to date, and consider use of a cloud-backed antivirus product that can benefit from the economies of scale this brings. Ensure that antivirus programs are also capable of scanning Microsoft Office macros.<br>See NCCIC Guidance: <a href=\"https://www.cisa.gov/news-events/news/understanding-anti-virus-software\" title=\"Understanding Anti-Virus Software\">Understanding Anti-Virus Software</a>.<br>See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/guidance/macro-security-for-microsoft-office\" title=\"Macro Security for Microsoft Office\">Macro Security for Microsoft Office</a>.</li>\n<li>Layer organization-wide phishing defenses. Detect and quarantine as many malicious email attachments and spam as possible, before they reach your end users. Multiple layers of defense will greatly cut the chances of a compromise.</li>\n<li>Treat people as your first line of defense. Tell personnel how to report suspected phishing emails, and ensure they feel confident to do so. Investigate their reports promptly and thoroughly. Never punish users for clicking phishing links or opening attachments.<br>NCCIC encourages users and administrators to report phishing to <a href=\"mailto:SayCISA@cisa.dhs.gov\" title=\"Report to CISA\">SayCISA@cisa.dhs.gov</a>.<br>See NCCIC Guidance: <a href=\"https://www.cisa.gov/news-events/news/avoiding-social-engineering-and-phishing-attacks\" title=\"Avoiding Social Engineering and Phishing Attacks\">Avoiding Social Engineering and Phishing Attacks</a>.<br>See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/guidance/phishing\" title=\"Phishing attacks: defending your organisation\">Phishing attacks: defending your organisation</a>.</li>\n<li>Deploy a host-based intrusion detection system. A variety of products are available, free and paid-for, to suit different needs and budgets.</li>\n<li>Defend your systems and networks against denial-of-service attacks.<br>See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/collection/denial-service-dos-guidance-collection\" title=\"Denial of Service (DoS) guidance\">Denial of Service (DoS) guidance</a>.</li>\n<li>Defend your organization from ransomware. Keep safe backups of important files, protect from malware, and do not pay the ransom– it may not get your data back.<br>See NCCIC Guidance: <a href=\"https://www.cisa.gov/stopransomware\" title=\"#StopRansomware\">Stop Ransomware</a>.<br>See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/guidance/mitigating-malware-and-ransomware-attacks\" title=\"Mitigating malware and ransomware attacks\">Mitigating malware and ransomware attacks</a> and <a href=\"https://www.ncsc.gov.uk/collection/small-business-guide/backing-your-data\" title=\"Step 1 - Backing up your data\">Step 1 - Backing up your data</a>.</li>\n<li>Make sure you are handling personal data appropriately and securely.<br>See NCCIC Guidance: https://www.us-cert.gov/ncas/tips/ST04-013.<br>See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/guidance/gdpr-security-outcomes\" title=\"GDPR security outcomes\">GDPR security outcomes</a>.&nbsp;&nbsp;</li>\n</ul>\n<p>Further information: invest in preventing malware-based attacks across various scenarios. See UK NCSC Guidance: <a href=\"https://www.ncsc.gov.uk/guidance/mitigating-malware-and-ransomware-attacks\" title=\"Mitigating malware and ransomware attacks\">Mitigating malware and ransomware attacks</a>.</p>\n<h3>Additional Resources from International Partners</h3>\n<ul>\n<li>Australian Cyber Security Centre (ACSC) Strategies - <a href=\"https://www.cyber.gov.au/resources-business-and-government/essential-cybersecurity/strategies-mitigate-cybersecurity-incidents\" title=\"Strategies to mitigate cybersecurity incidents\">Strategies to mitigate cybersecurity incidents</a></li>\n<li>ACSC Essential Eight - <a href=\"https://www.cyber.gov.au/resources-business-and-government/essential-cybersecurity/essential-eight\" title=\"Essential Eight\">Essential Eight</a></li>\n<li>Canadian Centre for Cyber Security (CCCS) Top 10 Security Actions - <a href=\"https://www.cyber.gc.ca/en/guidance/top-10-it-security-actions\" title=\"Top 10 IT security actions\">Top 10 IT security actions</a></li>\n<li>CCCS Cyber Hygiene - Cyber hygiene</li>\n<li>CERT New Zealand's Critical Controls 2018 - <a href=\"https://www.cert.govt.nz/information-and-advice/critical-controls/\" title=\"Critical Controls\">Critical Controls</a></li>\n<li>CERT New Zealand’s Top 11 Cyber Security Tips for Your Business - https://www.cert.govt.nz/businesses-and-individuals/guides/cyber-security-your-business/top-11-cyber-security-tips-for-your-business/</li>\n<li>New Zealand National Cyber Security Centre (NZ NCSC) Resources - <a href=\"https://www.ncsc.govt.nz/resources\" title=\"Resources\">Resources</a></li>\n<li>New Zealand Information Security Manual - <a href=\"https://nzism.gcsb.govt.nz/\" title=\"New Zealand Information Security Manual\">New Zealand Information Security Manual</a></li>\n<li>UK NCSC 10 Steps to Cyber Security - <a href=\"https://www.ncsc.gov.uk/collection/10-steps\" title=\"10 Steps to Cyber Security\">10 Steps to Cyber Security</a></li>\n<li>UK NCSC Board Toolkit: five questions for your board's agenda - https://www.ncsc.gov.uk/guidance/board-toolkit-five-questions-your-boards-agenda</li>\n<li>UK NCSC Cyber Security: Small Business Guide - <a href=\"https://www.ncsc.gov.uk/collection/small-business-guide\" title=\"Small Business Guide: Cyber Security\">Small Business Guide: Cyber Security</a></li>\n</ul>\n<div>\n<h2><strong>Contact Information</strong></h2>\n</div>\n<p>NCCIC encourages recipients of this report to contribute any additional information that they may have related to this threat. For any questions related to this report, please contact NCCIC at:</p>\n<ul>\n<li>1-844-Say-CISA (From outside the United States: +1-703-235-8832)</li>\n<li><a class=\"mailto\" href=\"mailto:SayCISA@cisa.dhs.gov\" title=\"Report to CISA\">SayCISA@cisa.dhs.gov</a> (UNCLASS)</li>\n</ul>\n<p>NCCIC encourages you to report any suspicious activity, including cybersecurity incidents, possible malicious code, software vulnerabilities, and phishing-related scams. Reporting forms can be found at <a href=\"https://myservices.cisa.gov/irf\" title=\"CISA Services Portal\">Incident Reporting Form Index - IRF</a>.</p>\n<h3>Feedback</h3>\n<p>NCCIC strives to make this report a valuable tool for our partners and welcomes feedback on how this publication could be improved. You can help by answering a few short questions about this report at the following URL: <a href=\"https://www.cisa.gov/forms/feedback\" title=\"CISA Website Feedback\">Website Feedback</a>.</p>\n<div>\n<h2><strong>References</strong></h2>\n<p>[1] <a href=\"https://www.cyber.gov.au/\" title=\"Australian Cyber Security Centre (ACSC)\">Australian Cyber Security Centre (ACSC)</a><br>[2] <a href=\"https://www.cyber.gc.ca/en\">Canadian Centre for Cyber Security (CCCS)</a><br>[3] <a href=\"https://www.ncsc.govt.nz/\" title=\"New Zealand National Cyber Security Centre (NZ NCSC)\">New Zealand National Cyber Security Centre (NZ NCSC)</a><br>[4] <a href=\"https://www.ncsc.gov.uk/\" title=\"United Kingdom National Cyber Security Centre\">UK National Cyber Security Centre (UK NCSC)</a><br>[5] <a href=\"https://www.cisa.gov/\" title=\"OWASP Top Ten\">Cybersecurity and Infrastructure Security Agency (CISA)</a><br>[6] <a href=\"https://owasp.org/www-project-top-ten/\" title=\"OWASP Top Ten\">OWASP Top Ten | OWASP Foundation</a><br>[7] <a href=\"https://cloud.google.com/blog/topics/threat-intelligence/breaking-down-the-china-chopper-web-shell-part-ii/\" title=\"Breaking Down the China Chopper Web Shell - Part II\">Breaking Down the China Chopper Web Shell - Part II | Mandiant | Google Cloud Blog</a><br>[8] <a href=\"https://support.microsoft.com/en-us/topic/microsoft-security-advisory-update-to-improve-credentials-protection-and-management-may-13-2014-93434251-04ac-b7f3-52aa-9f951c14b649\" title=\"Microsoft Security Advisory: Update to improve credentials protection and management: May 13, 2014\">Microsoft Security Advisory: Update to improve credentials protection and management: May 13, 2014 - Microsoft Support</a><br>[9] <a href=\"https://learn.microsoft.com/en-us/windows-server/identity/ad-ds/plan/security-best-practices/best-practices-for-securing-active-directory\" title=\"Best Practices for Securing Active Directory\">Best Practices for Securing Active Directory | Microsoft Learn</a><br>[10] <a href=\"https://reliaquest.com/blog/powershell-security-best-practices/\">PowerShell Security Best Practices</a></p>\n<h2><strong>Revisions</strong></h2>\n</div>\n<p><strong>October 11, 2018:</strong> Initial version</p>\n",
    "source": "CISA US-CERT",
    "timestamp": "2026-01-05T18:26:44.724Z"
  },
  {
    "id": "6ebfc325-eaa1-4d5a-b9fd-7aac83c589d0",
    "title": "SamSam Ransomware",
    "url": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa18-337a",
    "content": "<div>\n<h2><strong>Summary</strong></h2>\n</div>\n<p>The Department of Homeland Security (DHS) National Cybersecurity and Communications Integration Center (NCCIC) and the Federal Bureau of Investigation (FBI) are issuing this activity alert to inform computer network defenders about SamSam ransomware, also known as MSIL/Samas.A. Specifically, this product shares analysis of vulnerabilities that cyber actors exploited to deploy this ransomware. In addition, this report provides recommendations for prevention and mitigation.</p>\n<p>The SamSam actors targeted multiple industries, including some within critical infrastructure. Victims were located predominately in the United States, but also internationally. Network-wide infections against organizations are far more likely to garner large ransom payments than infections of individual systems. Organizations that provide essential functions have a critical need to resume operations quickly and are more likely to pay larger ransoms.</p>\n<p>The actors exploit Windows servers to gain persistent access to a victim’s network and infect all reachable hosts. According to reporting from victims in early 2016, cyber actors used the JexBoss Exploit Kit to access vulnerable JBoss applications. Since mid-2016, FBI analysis of victims’ machines indicates that cyber actors use Remote Desktop Protocol (RDP) to gain persistent access to victims’ networks. Typically, actors either use brute force attacks or stolen login credentials. Detecting RDP intrusions can be challenging because the malware enters through an approved access point.</p>\n<p>After gaining access to a particular network, the SamSam actors escalate privileges for administrator rights, drop malware onto the server, and run an executable file, all without victims’ action or authorization. While many ransomware campaigns rely on a victim completing an action, such as opening an email or visiting a compromised website, RDP allows cyber actors to infect victims with minimal detection.</p>\n<p>Analysis of tools found on victims’ networks indicated that successful cyber actors purchased several of the stolen RDP credentials from known darknet marketplaces. FBI analysis of victims’ access logs revealed that the SamSam actors can infect a network within hours of purchasing the credentials. While remediating infected systems, several victims found suspicious activity on their networks unrelated to SamSam. This activity is a possible indicator that the victims’ credentials were stolen, sold on the darknet, and used for other illegal activity.</p>\n<p>SamSam actors leave ransom notes on encrypted computers. These instructions direct victims to establish contact through a Tor hidden service site. After paying the ransom in Bitcoin and establishing contact, victims usually receive links to download cryptographic keys and tools to decrypt their network.</p>\n<div>\n<h2><strong>Technical Details</strong></h2>\n</div>\n<p>NCCIC recommends organizations review the following SamSam Malware Analysis Reports. The reports represent four SamSam malware variants. This is not an exhaustive list.</p>\n<ul>\n<li><a href=\"https://www.cisa.gov/ncas/analysis-reports/AR18-337A\">MAR-10219351.r1.v2 – SamSam1</a></li>\n<li><a href=\"https://www.cisa.gov/ncas/analysis-reports/AR18-337B\">MAR-10166283.r1.v1 – SamSam2</a></li>\n<li><a href=\"https://www.cisa.gov/ncas/analysis-reports/AR18-337C\">MAR-10158513.r1.v1 – SamSam3</a></li>\n<li><a href=\"https://www.cisa.gov/ncas/analysis-reports/AR18-337D\">MAR-10164494.r1.v1 – SamSam4</a></li>\n</ul>\n<p>For general information on ransomware, see the NCCIC Security Publication at <a href=\"https://www.cisa.gov/stopransomware\" title=\"#StopRansomware\">Stop Ransomware</a>.</p>\n<div>\n<h2><strong>Mitigations</strong></h2>\n</div>\n<p>DHS and FBI recommend that users and administrators consider using the following best practices to strengthen the security posture of their organization's systems. System owners and administrators should review any configuration changes before implementation to avoid unwanted impacts.</p>\n<ul>\n<li>Audit your network for systems that use RDP for remote communication. Disable the service if unneeded or install available patches. Users may need to work with their technology venders to confirm that patches will not affect system processes.</li>\n<li>Verify that all cloud-based virtual machine instances with public IPs have no open RDP ports, especially port 3389, unless there is a valid business reason to keep open RDP ports. Place any system with an open RDP port behind a firewall and require users to use a virtual private network (VPN) to access that system.</li>\n<li>Enable strong passwords and account lockout policies to defend against brute force attacks.</li>\n<li>Where possible, apply two-factor authentication.</li>\n<li>Regularly apply system and software updates.</li>\n<li>Maintain a good back-up strategy.</li>\n<li>Enable logging and ensure that logging mechanisms capture RDP logins. Keep logs for a minimum of 90 days and review them regularly to detect intrusion attempts.</li>\n<li>When creating cloud-based virtual machines, adhere to the cloud provider’s best practices for remote access.</li>\n<li>Ensure that third parties that require RDP access follow internal policies on remote access.</li>\n<li>Minimize network exposure for all control system devices. Where possible, disable RDP on critical devices.</li>\n<li>Regulate and limit external-to-internal RDP connections. When external access to internal resources is required, use secure methods such as VPNs. Of course, VPNs are only as secure as the connected devices.</li>\n<li>Restrict users' ability (permissions) to install and run unwanted software applications.</li>\n<li>Scan for and remove suspicious email attachments; ensure the scanned attachment is its \"true file type\" (i.e., the extension matches the file header).</li>\n<li>Disable file and printer sharing services. If these services are required, use strong passwords or Active Directory authentication.</li>\n</ul>\n<p>Additional information on malware incident prevention and handling can be found in Special Publication 800-83, <em>Guide to Malware Incident Prevention and Handling for Desktops and Laptops</em>, from the National Institute of Standards and Technology.[<a href=\"https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-83r1.pdf\" title=\"NIST SP 800-83: Guide to Malware Incident Prevention and Handling for Desktops and Laptops\">1</a>]</p>\n<div>\n<h2><strong>Contact Information</strong></h2>\n</div>\n<p>To report an intrusion and request resources for incident response or technical assistance, contact NCCIC, FBI, or the FBI’s Cyber Division via the following information:</p>\n<ul>\n<li>NCCIC\n<ul>\n<li><a href=\"mailto:SayCISA@cisa.dhs.gov\" title=\"Report to CISA\">SayCISA@cisa.dhs.gov</a></li>\n<li>1-844-Say-CISA</li>\n</ul>\n</li>\n<li>FBI’s Cyber Division\n<ul>\n<li><a href=\"mailto:CyWatch@fbi.gov\">CyWatch@fbi.gov</a></li>\n<li>855-292-3937</li>\n</ul>\n</li>\n<li>FBI through a <a href=\"https://www.fbi.gov/contact-us/field-offices\" title=\"local field office\">local field office</a></li>\n</ul>\n<h2><strong>Feedback</strong></h2>\n<p>DHS strives to make this report a valuable tool for our partners and welcomes feedback on how this publication could be improved. You can help by answering a few short questions about this report at the following URL: <a href=\"https://www.cisa.gov/forms/feedback\" title=\"CISA Website Feedback\">Website Feedback</a>.</p>\n<div>\n<h2><strong>References</strong></h2>\n<p>[1] <a href=\"https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-83r1.pdf\" title=\"NIST SP 800-83: Guide to Malware Incident Prevention and Handling for Desktops and Laptops\">NIST SP 800-83: Guide to Malware Incident Prevention and Handling for Desktops and Laptops</a></p>\n</div>\n<div>\n<h2><strong>Revisions</strong></h2>\n</div>\n<p><strong>December 3, 2018:</strong> Initial version</p>\n",
    "source": "CISA US-CERT",
    "timestamp": "2026-01-05T18:26:44.728Z"
  },
  {
    "id": "7910f2a2-6eb7-4313-bf5b-4d72d71150ee",
    "title": "DNS Infrastructure Hijacking Campaign",
    "url": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa19-024a",
    "content": "<div>\n<h2><strong>Summary</strong></h2>\n</div>\n<p>The National Cybersecurity and Communications Integration Center (NCCIC), part of the Cybersecurity and Infrastructure Security Agency (CISA), is aware of a global Domain Name System (DNS) infrastructure hijacking campaign. Using compromised credentials, an attacker can modify the location to which an organization’s domain name resources resolve. This enables the attacker to redirect user traffic to attacker-controlled infrastructure and obtain valid encryption certificates for an organization’s domain names, enabling man-in-the-middle attacks.</p>\n<p>See the following links for downloadable copies of open-source&nbsp;indicators of compromise&nbsp;(IOCs) from the sources listed in the References section below:</p>\n<ul>\n<li><a href=\"https://www.cisa.gov/sites/default/files/publications/AA19-024A_IOCs.csv\">IOCs (.csv)</a></li>\n<li><a href=\"https://www.cisa.gov/sites/default/files/publications/AA19-024A_IOCs.stix.xml\">IOCs (.stix)</a></li>\n</ul>\n<p>Note: these files were last updated February 13, 2019, to remove the following three&nbsp;non-malicious IP addresses:</p>\n<ul>\n<li>107.161.23.204</li>\n<li>192.161.187.200</li>\n<li>209.141.38.71</li>\n</ul>\n<div>\n<h2><strong>Technical Details</strong></h2>\n</div>\n<p>Using the following techniques, attackers have redirected and intercepted web and mail traffic, and could do so for other networked services.</p>\n<ol>\n<li>The attacker begins by compromising user credentials, or obtaining them through alternate means, of an account that can make changes to DNS records.</li>\n<li>Next, the attacker alters DNS records, like Address (A), Mail Exchanger (MX), or Name Server (NS) records, replacing the legitimate address of a service with an address the attacker controls. This enables them to direct user traffic to their own infrastructure for manipulation or inspection before passing it on to the legitimate service, should they choose. This creates a risk that persists beyond the period of traffic redirection.</li>\n<li>Because the attacker can set DNS record values, they can also obtain valid encryption certificates for an organization’s domain names. This allows the redirected traffic to be decrypted, exposing any user-submitted data. Since the certificate is valid for the domain, end users receive no error warnings.</li>\n</ol>\n<div>\n<h2><strong>Mitigations</strong></h2>\n</div>\n<p>NCCIC recommends the following best practices to help safeguard networks against this threat:</p>\n<ul>\n<li>Update the passwords for all accounts that can change organizations’ DNS records.</li>\n<li>Implement multifactor authentication on domain registrar accounts, or on other systems used to modify DNS records.</li>\n<li>Audit public DNS records to verify they are resolving to the intended location.</li>\n<li>Search for encryption certificates related to domains and revoke any fraudulently requested certificates.</li>\n</ul>\n<div>\n<h2><strong>References</strong></h2>\n<ul>\n<li><a href=\"https://blog.talosintelligence.com/dnspionage-campaign-targets-middle-east/\" title=\"DNSpionage Campaign Targets Middle East\">Cisco Talos blog: DNSpionage Campaign Targets Middle East</a></li>\n<li>CERT-OPMD blog: [DNSPIONAGE] – Focus on internal actions</li>\n<li><a href=\"https://cloud.google.com/blog/topics/threat-intelligence/global-dns-hijacking-campaign-dns-record-manipulation-at-scale/\" title=\"Global DNS Hijacking Campaign: DNS Record Manipulation at Scale\">Global DNS Hijacking Campaign: DNS Record Manipulation at Scale | Mandiant | Google Cloud Blog</a></li>\n<li>Crowdstrike blog: Widespread DNS Hijacking Activity Targets Multiple Sectors</li>\n</ul>\n<h2><strong>Revisions</strong></h2>\n</div>\n<p><strong>January 24, 2019:</strong> Initial version<br><strong>February 6, 2019:</strong> Updated IOCs, added Crowdstrike blog<br><strong>February 13, 2019:</strong> Updated IOCs</p>\n",
    "source": "CISA US-CERT",
    "timestamp": "2026-01-05T18:26:44.730Z"
  },
  {
    "id": "0af9123f-a361-4e99-afed-a4dec1c9d5b9",
    "title": "New Exploits for Unsecure SAP Systems",
    "url": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa19-122a",
    "content": "<div>\n<h2><strong>Summary</strong></h2>\n</div>\n<p>The Cybersecurity and Infrastructure Security Agency (CISA) is issuing this activity alert in response to recently disclosed exploits that target unsecure configurations of SAP components. [<a href=\"https://github.com/msuiche/OPCDE/tree/master/2019/Emirates/(SAP)%20Gateway%20to%20Heaven%20-%20Dmitry%20Chastuhin%2C%20Mathieu%20Geli\" title=\"(SAP) Gateway to Heaven - Dmitry Chastuhin, Mathieu Geli\">1</a>]</p>\n<div>\n<h2><strong>Technical Details</strong></h2>\n</div>\n<p>A presentation at the April 2019 Operation for Community Development and Empowerment (OPCDE) cybersecurity conference describes SAP systems with unsecure configurations exposed to the internet. Typically, SAP systems are not intended to be exposed to the internet as it is an untrusted network. Malicious cyber actors can attack and compromise these unsecure systems with publicly available exploit tools, termed “10KBLAZE.” The presentation details the new exploit tools and reports on systems exposed to the internet.</p>\n<h3>SAP Gateway ACL</h3>\n<p>The SAP Gateway allows non-SAP applications to communicate with SAP applications. If SAP Gateway access control lists (ACLs) are not configured properly (e.g., gw/acl_mode = 0), anonymous users can run operating system (OS) commands.[2] According to the OPCDE presentation, about 900 U.S. internet-facing systems were detected in this vulnerable condition.</p>\n<h3>SAP Router secinfo</h3>\n<p>The SAP router is a program that helps connect SAP systems with external networks. The default <code>secinfo</code> configuration for a SAP Gateway allows any internal host to run OS commands anonymously. If an attacker can access a misconfigured SAP router, the router can act as an internal host and proxy the attacker’s requests, which may result in remote code execution.</p>\n<p>According to the OPCDE presentation, 1,181 SAP routers were exposed to the internet. It is unclear if the exposed systems were confirmed to be vulnerable or were simply running the SAP router service.</p>\n<h3>SAP Message Server</h3>\n<p>SAP Message Servers act as brokers between Application Servers (AS). By default, Message Servers listen on a port 39XX and have no authentication. If an attacker can access a Message Server, they can redirect and/or execute legitimate man-in-the-middle (MITM) requests, thereby gaining credentials. Those credentials can be used to execute code or operations on AS servers (assuming the attacker can reach them). According to the OPCDE presentation, there are 693 Message Servers exposed to the internet in the United States. The Message Server ACL must be protected by the customer in all releases.</p>\n<h3>Signature</h3>\n<p>CISA worked with security researchers from Onapsis Inc.[<a href=\"https://www.onapsis.com/\" title=\"Onapsis\">3</a>] to develop the following Snort signature that can be used to detect the exploits:</p>\n<p><code>alert tcp $EXTERNAL_NET any -&gt; $HOME_NET any (msg:\"10KBLAZE SAP Exploit execute attempt\"; flow:established,to_server; content:\"|06 cb 03|\"; offset:4; depth:3; content:\"SAPXPG_START_XPG\"; nocase; distance:0; fast_pattern; content:\"37D581E3889AF16DA00A000C290099D0001\"; nocase; distance:0; content:\"extprog\"; nocase; distance:0; sid:1; rev:1;)</code></p>\n<h2><strong>Mitigations</strong></h2>\n<p>CISA recommends administrators of SAP systems implement the following to mitigate the vulnerabilities included in the OPCDE presentation:</p>\n<ul>\n<li>Ensure a secure configuration of their SAP landscape.</li>\n<li>Restrict access to SAP Message Server.\n<ul>\n<li>Review SAP Notes 1408081 and 821875. Restrict authorized hosts via ACL files on Gateways (<code>gw/acl_mode </code>and <code>secinfo</code>) and Message Servers (<code>ms/acl_info</code>).[4], [5]</li>\n<li>Review SAP Note 1421005. Split MS internal/public:<code> rdisp/msserv=0 rdisp/msserv_internal=39NN</code>. [6]</li>\n<li>Restrict access to Message Server internal port (<code>tcp/39NN</code>) to clients or the internet.</li>\n<li>Enable Secure Network Communications (SNC) for clients.</li>\n</ul>\n</li>\n<li>Scan for exposed SAP components.\n<ul>\n<li>Ensure that SAP components are not exposed to the internet.</li>\n<li>Remove or secure any exposed SAP components.</li>\n</ul>\n</li>\n</ul>\n<div>\n<h2><strong>References</strong></h2>\n<p>[1] <a href=\"https://github.com/msuiche/OPCDE/tree/master/2019/Emirates/(SAP)%20Gateway%20to%20Heaven%20-%20Dmitry%20Chastuhin%2C%20Mathieu%20Geli\" title=\"(SAP) Gateway to Heaven - Dmitry Chastuhin, Mathieu Geli\">Comae Technologies: Operation for Community Development and Empowerment (OPCDE) Cybersecurity Conference Materials</a><br>[2] SAP: Gateway Access Control Lists<br>[3] <a href=\"https://www.onapsis.com\" title=\"Onapsis\">Onapsis Inc. website</a><br>[4] SAP Note 1408081<br>[5] SAP Note 821875<br>[6] SAP Note 1421005</p>\n<h2><strong>Revisions</strong></h2>\n</div>\n<p><strong>May 2, 2019:</strong> Initial version</p>\n",
    "source": "CISA US-CERT",
    "timestamp": "2026-01-05T18:26:44.731Z"
  },
  {
    "id": "c6e6c376-a549-42ee-9e91-d062a4617b6b",
    "title": "Microsoft Operating Systems BlueKeep Vulnerability",
    "url": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa19-168a",
    "content": "<div>\n<h2><strong>Summary</strong></h2>\n</div>\n<p>The Cybersecurity and Infrastructure Security Agency (CISA) is issuing this Activity Alert to provide information on a vulnerability, known as “BlueKeep,” that exists in the following Microsoft Windows Operating Systems (OSs), including both 32- and 64-bit versions, as well as all Service Pack versions:</p>\n<ul>\n<li>Windows 2000</li>\n<li>Windows Vista</li>\n<li>Windows XP</li>\n<li>Windows 7</li>\n<li>Windows Server 2003</li>\n<li>Windows Server 2003 R2</li>\n<li>Windows Server 2008</li>\n<li>Windows Server 2008 R2</li>\n</ul>\n<p>An attacker can exploit this vulnerability to take control of an affected system. &nbsp;&nbsp; &nbsp;</p>\n<div>\n<h2><strong>Technical Details</strong></h2>\n</div>\n<p>BlueKeep (CVE-2019-0708) exists within the Remote Desktop Protocol (RDP) used by the Microsoft Windows OSs listed above. An attacker can exploit this vulnerability to perform remote code execution on an unprotected system.&nbsp;</p>\n<p>According to Microsoft, an attacker can send specially crafted packets to one of these operating systems that has RDP enabled.[<a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2019-0708\" title=\"Remote Desktop Services Remote Code Execution Vulnerability\">1</a>] After successfully sending the packets, the attacker would have the ability to perform a number of actions: adding accounts with full user rights; viewing, changing, or deleting data; or installing programs. This exploit, which requires no user interaction, must occur before authentication to be successful.</p>\n<p>BlueKeep is considered “wormable” because malware exploiting this vulnerability on a system could propagate to other vulnerable systems; thus, a BlueKeep exploit would be capable of rapidly spreading in a fashion similar to the WannaCry malware attacks of 2017.[2]</p>\n<p>CISA has coordinated with external stakeholders and determined that Windows 2000 is vulnerable to BlueKeep.</p>\n<div>\n<h3>Mitigations</h3>\n</div>\n<p>CISA encourages users and administrators review the Microsoft Security Advisory [<a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2019-0708\" title=\"Remote Desktop Services Remote Code Execution Vulnerability\">1</a>] and the Microsoft Customer Guidance for CVE-2019-0708 [<a href=\"https://support.microsoft.com/en-us/topic/customer-guidance-for-cve-2019-0708-remote-desktop-services-remote-code-execution-vulnerability-may-14-2019-0624e35b-5f5d-6da7-632c-27066a79262e\" title=\"Customer guidance for CVE-2019-0708 | Remote Desktop Services Remote Code Execution Vulnerability: May 14, 2019\">3</a>] and apply the appropriate mitigation measures as soon as possible:</p>\n<ul>\n<li><strong>Install available patches.</strong> Microsoft has released security updates to patch this vulnerability. Microsoft has also released patches for a number of OSs that are no longer officially supported, including Windows Vista, Windows XP, and Windows Server 2003. As always, CISA encourages users and administrators to test patches before installation.</li>\n</ul>\n<p>For OSs that do not have patches or systems that cannot be patched, other mitigation steps can be used to help protect against BlueKeep:</p>\n<ul>\n<li><strong>Upgrade end-of-life (EOL) OSs.</strong> Consider upgrading any EOL OSs no longer supported by Microsoft to a newer, supported OS, such as Windows 10.</li>\n<li><strong>Disable unnecessary services.</strong> Disable services not being used by the OS. This best practice limits exposure to vulnerabilities. &nbsp;</li>\n<li><strong>Enable Network Level Authentication.</strong> Enable Network Level Authentication in Windows 7, Windows Server 2008, and Windows Server 2008 R2. Doing so forces a session request to be authenticated and effectively mitigates against BlueKeep, as exploit of the vulnerability requires an unauthenticated session.</li>\n<li><strong>Block Transmission Control Protocol (TCP) port 3389 at the enterprise perimeter firewall.</strong> Because port 3389 is used to initiate an RDP session, blocking it prevents an attacker from exploiting BlueKeep from outside the user’s network. However, this will block legitimate RDP sessions and may not prevent unauthenticated sessions from being initiated inside a network.</li>\n</ul>\n<div>\n<h2><strong>References</strong></h2>\n<p>[1] <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2019-0708\" title=\"Remote Desktop Services Remote Code Execution Vulnerability\">Microsoft Security Advisory for CVE-2019-0708</a><br>[2] White House Press Briefing on the Attribution of the WannaCry Malware Attack to North Korea<br>[3] <a href=\"https://support.microsoft.com/en-us/topic/customer-guidance-for-cve-2019-0708-remote-desktop-services-remote-code-execution-vulnerability-may-14-2019-0624e35b-5f5d-6da7-632c-27066a79262e\" title=\"Customer guidance for CVE-2019-0708 | Remote Desktop Services Remote Code Execution Vulnerability: May 14, 2019\">Microsoft Customer Guidance for CVE-2019-0708</a></p>\n</div>\n<div>\n<h2><strong>Revisions</strong></h2>\n</div>\n<p><strong>June 17, 2019:</strong> Initial version<br><strong>June 17, 2019:</strong> Revised technical details section.</p>\n",
    "source": "CISA US-CERT",
    "timestamp": "2026-01-05T18:26:44.733Z"
  }
]